{"city": "SAN ANTONIO", "addr": "1902 Pecan Valley Dr", "zip": "78210", "price": "42000", "pid": "102499198", "seller": "Roland Dee De Leon", "state": "TX", "lotSize": "19746", "type": "VacantResidentialLand", "description": "Adjacent lots are 38, 39, & 40. All Lots are the about the same size. Owner is selling all 3 lots as a package. Lots face Pecan Valley Rd and back up to elementary school. Lot Size & Taxes are estimated. See Additional Docs.   Additional County Acct No: 103190000390, 103190000400"}
{"city": "San Diego", "addr": "7760 Chadamy Way", "zip": "92130", "price": "1119000", "pid": "112904818", "homeSize": "3098", "beds": "5", "state": "CA", "yearBuilt": "2012", "baths": "4.5", "type": "SingleFamily", "description": "Coming Soon in Maricel at Torrey Highlands- An intimate gated community of 41 homes surrounded by open space. Nestled in Maricel, this 5 bedroom home offers a very open floor plan with a full bedroom and bathroom downstairs, a drop zone area strategically located off the garage entry way and bi-fold doors from the Family Room to the back yard. The generous upstairs includes tech space, laundry room, 4 bedrooms and a loft. This is a dream kitchen adorned with Bianco Carerra Marble countertops and backsplash.  Sellers have added over $100K in additional upgrades, this home is a show-stopper! Email info@talechia.com for additional pictures."}
{"city": "Pittsburgh", "addr": "2641 Shelton Ave", "zip": "15214", "price": "33333", "pid": "11505140", "homeSize": "1200", "beds": "2", "state": "PA", "yearBuilt": "1900", "lotSize": "2500", "baths": "1.5", "type": "SingleFamily", "description": "*****PLEASE NOTE: LISTING PRICE TO BE DETERMINED. PRICE SHOW IS NOT THE ANTICIPATED LISTING PRICE*****"}
{"city": "San Francisco", "addr": "420 Mission Bay Blvd N UNIT 1103", "zip": "94158", "price": "1749000", "pid": "115828709", "homeSize": "1562", "beds": "2", "state": "CA", "yearBuilt": "2012", "baths": "2.0", "type": "Condominium", "description": "Exemplary Living in Gorgeous Mission Bay Experience the lifestyle, luxury, and convenience of unparalleled building amenities in one of Californias best-selling residential communities: Madrone by Bosa. Residence #1103 at the Madrone features luxury living at its finest. Upon entering this pristine 2 bedroom, 2 bathroom property through its formal entryway, you are greeted with a huge living area with panoramic views of the bay and adjoining park from brilliant floor-to-ceiling windows with Hunter Douglas window treatments. Beautiful hardwood floors are featured throughout the spacious main living area along with a balcony that allows for outdoor relaxation and contemplation with views of downtown. The amply appointed chefs kitchen, open to the main living area, features top-of-the-line finishes and appliances. A Bosch gas stove, Bosch dishwasher, Thermador refrigerator, Caesarstone countertops, and sleek European-inspired cabinetry allow you to dine and entertain in splendid fashion. The split layout of the residence allows for optimal privacy between bedrooms. The master bedroom features a spacious en-suite bathroom with twin sinks along with expansive closets and floor-to-ceiling windows. The second bedroom is just as spacious as the master suite and features a pop-out bay window, a perfect location for an office or study. Along with a full-sized washer and dryer and air conditioning, Residence #1103 offers unmatched finishes and fixtures that define contemporary luxury living. Come and experience all that Madrone has to offer with Residence #1103. Indulge in Madrones resort-like amenities including an open-air sun deck, 75-foot heated lap pool, fun-sized jacuzzi spa, resort-style steam room and sauna, outdoor grill and terrace lounge, social dining room with a catering kitchen, game room with flat screen TVs and billiards, private movie theater, state-of-the-art fitness studio, landscaped gardens and courtyard, attended lobby, and hotel-style reception area. Madrone is located in the heart of Mission Bay, San Franciscos newest, fastest-growing master-planned community that is welcoming new residents, retail, businesses, and parks every day. Living at Madrone you are at the center of a vibrant, walkable neighborhood surrounded by parks and open spaces, close to AT&T Park, Caltrain, and Muni. 50,000 square feet of retail are currently planned for the surrounding area, including a new UCSF research hospital opening in 2015 and plans for a new sports and entertainment arena. With companies like Old Navy, Nektar, Fibrogen, and UCSF as major employers in Mission Bay, there will always be a strong demand for homes at Madrone. Unit Features: Open living/dining room with floor-to-ceiling windows Gourmet kitchen with stainless steel Bosch appliances, Caesarstone countertops, sleek European-inspired cabinetry Spacious balcony perfect for outdoor enjoyment Master bedroom with en-suite bathroom Second bedroom and bathroom Individually controlled heat and air conditioning Hardwood floors in living areas, carpet in bedrooms Whirlpool front-loading washer and dryer in unit One space in parking garage included Storage included Building Features: Open-air sun deck with 75-foot heated lap pool and jacuzzi spa Outdoor grill and terrace lounge State-of-the-art fitness studio Resort-style steam room and sauna Social dining room with catering kitchen Game room with flat screen TVs and billiards Private movie theater Business center Attended lobby and luxurious seating area Landscaped gardens and courtyard Gated parking Located close to public transportation with easy access to freeways 280/101, Caltrain and corporate shuttles Walk to the AT&T stadium, UCSF campus, a farmers market, Safeway, Whole Foods, eateries, and nightlife"}
{"city": "San Francisco", "addr": "420 Mission Bay Blvd N UNIT 509", "zip": "94158", "price": "1395000", "pid": "115876290", "homeSize": "1219", "beds": "2", "state": "CA", "yearBuilt": "2012", "baths": "2.0", "type": "Condominium", "description": "Coming Soon: Exemplary Living in Gorgeous Mission Bay Experience the lifestyle, luxury, and convenience of unparalleled building amenities in one of Californias best-selling residential communities: Madrone by Bosa. Residence #509 at the Madrone features luxury living at its finest. Upon entering this pristine 2 bedroom, 2 bathroom property, you are greeted with a huge living area with exceptional views of the interior courtyard and pool through a pop-out bay window. Beautiful hardwood floors are featured throughout the spacious main living area along with a balcony that allows for outdoor relaxation and contemplation. The amply appointed chefs kitchen, open to the main living area, features top-of-the-line finishes and appliances. A Bosch gas stove, Bosch dishwasher, Thermador refrigerator, Caesarstone countertops, and sleek European-inspired cabinetry allow you to dine and entertain in splendid fashion. Ample cabinet space is also featured in the kitchen. The split layout of the residence allows for optimal privacy between bedrooms. The master bedroom features a spacious en-suite bathroom along with expansive closets and floor-to-ceiling windows. The second bedroom is just as spacious as the master suite. Both bedrooms also feature the amazing courtyard views as seen from the main living area. Along with a full-sized washer and dryer and air conditioning, Residence #509 offers unmatched finishes and fixtures that define contemporary luxury living. Come and experience all that Madrone has to offer with Residence #509. Indulge in Madrones resort-like amenities including an open-air sun deck, 75-foot heated lap pool, fun-sized jacuzzi spa, resort-style steam room and sauna, outdoor grill and terrace lounge, social dining room with a catering kitchen, game room with flat screen TVs and billiards, private movie theater, state-of-the-art fitness studio, landscaped gardens and courtyard, attended lobby, and hotel-style reception area. Madrone is located in the heart of Mission Bay, San Franciscos newest, fastest-growing master-planned community that is welcoming new residents, retail, businesses, and parks every day. Living at Madrone you are at the center of a vibrant, walkable neighborhood surrounded by parks and open spaces, close to AT&T Park, Caltrain, and Muni. 50,000 square feet of retail are currently planned for the surrounding area, including a new UCSF research hospital opening in 2015 and plans for a new sports and entertainment arena. With companies like Old Navy, Nektar, Fibrogen, and UCSF as major employers in Mission Bay, there will always be a strong demand for homes at Madrone. Unit Features:  Open living/dining room with floor-to-ceiling windows Courtyard and pool views from the living area and both bedrooms Gourmet kitchen with stainless steel Bosch appliances, Caesarstone countertops, sleek European-inspired cabinetry Spacious balcony perfect for outdoor enjoyment Master bedroom with en-suite bathroom Second bedroom and bathroom Individually controlled heat and air conditioning Hardwood floors in living areas, carpet in bedrooms Whirlpool front-loading washer and dryer in unit One space in parking garage included Storage included Building Features:  Open-air sun deck with 75-foot heated lap pool and jacuzzi spa Outdoor grill and terrace lounge State-of-the-art fitness studio Resort-style steam room and sauna Social dining room with catering kitchen Game room with flat screen TVs and billiards Private movie theater Business center Attended lobby and luxurious seating area Landscaped gardens and courtyard Gated parking Located close to public transportation with easy access to freeways 280/101, Caltrain and corporate shuttles Walk to the AT&T stadium, UCSF campus, a farmers market, Safeway, Whole Foods, eateries, and nightlife"}
{"city": "San Diego", "addr": "7837 Inception Way", "zip": "92108", "price": "640000", "pid": "120796815", "homeSize": "1814", "beds": "3", "state": "CA", "yearBuilt": "2013", "baths": "3.5", "type": "Condominium", "description": "Wonderful Condo in the Heart of Civita. Loads and Loads of Upgrades right in the Heart of Mission Valley. \nCall 888-411-4223 xt 777 for more information! "}
{"city": "SAN FRANCISCO", "addr": "230-232 Anza St", "zip": "94118", "price": "899000", "pid": "15083879", "homeSize": "1600", "seller": "Patrick Lam -Top #1 Producer", "state": "CA", "yearBuilt": "1900", "lotSize": "2495", "baths": "2.0", "type": "MultiFamily2To4", "description": "Location! Location! Location! This Duplex is right across of University of San Francisco. Great Fixer Upper! Great Opportunity! Hurry! Don't miss it! RH-3 Zoning. PROBATE, no court confirmation required SUBJECT TO ACCEPTANCE BY COURT APPOINTED PERSONAL REPRESENTATIVES. OPEN HOUSES 4/4,4/5,4/11,4/12 at 2-4pm. Twilight Showings 4/6-4/10, 4-6PM.  OFFER DATE: Tuesday 4/14 by 5PM. "}
{"city": "San Francisco", "addr": "1783 Turk St", "zip": "94115", "price": "789000", "pid": "15085038", "homeSize": "1261", "seller": "Heidi Mueller", "beds": "2", "state": "CA", "yearBuilt": "1900", "baths": "1.0", "type": "Condominium", "description": "Victorian lovers, this is a fabulous spacious condo, the kind that San Francisco is famous for. It has a beautiful bright living room with a decorative fireplace and bay windows. The formal dining room is ideal for gracious entertaining. The typical flexible floorplan of the era has 2 bedrooms, one with a decorative fireplace, built-ins and a box beam ceiling and a huge closet. The bathroom is nicely updated. The kitchen is elegantly remodeled with stainless steel appliances and granite countertops. Adjacent is an inviting den/office with French doors opening to a private deck and outdoor space exclusively for this flat. W/D. HDWD. Live close to Haight, Hayes Valley, Clement, J-town, Fillmore, Kaiser, cafes, restaurants and downtown buses."}
{"city": "San Francisco", "addr": "336 Lakeview Ave", "zip": "94112", "price": "719000", "pid": "15192091", "homeSize": "1225", "beds": "3", "state": "CA", "yearBuilt": "1938", "lotSize": "2495", "baths": "2.0", "type": "SingleFamily", "description": "GREAT HOME IN GREAT LOCATION \nIN LAW UNIT DOWNSTAIRS (BUYER TO VERIFY PROPERTY PROFILE)\nCALL NOW FOR MORE DETAILS: (650) 270-4733"}
{"city": "Stockton", "addr": "3117 Otto Dr", "zip": "95209", "price": "220000", "pid": "15282100", "homeSize": "1427", "seller": "Serina Molina", "beds": "3", "state": "CA", "yearBuilt": "1987", "lotSize": "6905", "baths": "2.0", "type": "SingleFamily", "description": "A little elbow grease goes a long way. Make this home your own...just needs your finishing touches. This 3bd 2ba home is in North Stockton in a great community. A little TLC will make is shine. What a great price!"}
{"city": "Stockton", "addr": "3840 Fort Donelson Dr", "zip": "95219", "price": "529900", "pid": "15301103", "homeSize": "2450", "seller": "Pat Holkesvig", "beds": "3", "state": "CA", "yearBuilt": "1980", "lotSize": "9024", "baths": "2.5", "type": "SingleFamily", "description": "LUXURIOUS single story lakefront home located in prestigious LVW! Impeccable one of a kind home features open floor-plan with lots of natural light. Many upgrades throughout.  Formal dining and living areas. Cozy family room with fireplace off of gourmet kitchen.  Plantation shutters. Captivating lake views.  Beautiful private backyard with lush landscaping and covered patio. Boat dock.  Spotless. Calm and serene living space."}
{"city": "Stockton", "addr": "2135 N Stockton St", "zip": "95204", "price": "249950", "pid": "15312232", "homeSize": "1588", "beds": "3", "state": "CA", "yearBuilt": "1947", "lotSize": "5625", "baths": "2.0", "type": "SingleFamily"}
{"city": "Stockton", "addr": "1520 W Harding Way", "zip": "95203", "price": "219950", "pid": "15323973", "homeSize": "1700", "beds": "4", "state": "CA", "yearBuilt": "1926", "lotSize": "5662", "baths": "3.0", "type": "SingleFamily"}
{"city": "San Diego", "addr": "4738 Caminito Lapiz", "zip": "92130", "price": "869000", "pid": "16771666", "homeSize": "2164", "beds": "4", "state": "CA", "yearBuilt": "1998", "baths": "2.5", "type": "Condominium", "description": "Open House 4/4 from 11-4pm and 4/5 from 1-4pm!! Highly desirable Stone Canyon featuring 4 bedrooms with wonderful upgrades including wood floors, plantation shutters, stunning remodeled kitchen open to family room, spacious master suite with updated master bath and huge walk-in closet with custom organizers. All this plus wonderful interior location cul-de-sac location, gated community with pool, neighboring\ncommunity park, top rated schools, low fees and so much more! Exclusively listed by Coastal Premier. Contact listing agent Susan Meyers-Pyke directly at susan@amyandsusan.com or 858-395-4068"}
{"city": "San Diego", "addr": "3583 Caminito Carmel Lndg", "zip": "92130", "price": "468000", "pid": "16775551", "homeSize": "1068", "beds": "2", "state": "CA", "yearBuilt": "1984", "baths": "2.5", "type": "Townhouse", "description": "Beautifully upgraded Carmel Valley townhome with cherry wood floors, custom paint, fireplace and lovely private patio with trellis. Stone flooring in bathrooms, granite counters in kitchen and stainless steel appliances. Faux wood blinds and other designer touches throughout.  Washer/dryer hookup upstairs. One car detached garage, community pool and tennis courts. Great west-side Carmel Valley location with easy freeway access to I-5 or 56. Walk to Del Mar Highlands Shopping Center!"}
{"city": "San Diego", "addr": "10260 Black Mountain Rd APT 134", "zip": "92126", "price": "165000", "pid": "16832408", "homeSize": "525", "beds": "1", "state": "CA", "yearBuilt": "1978", "lotSize": "418176", "baths": "1.0", "type": "Condominium", "description": "1st and last months rent and $750 deposit with a min of 6 month lease"}
{"city": "La Jolla", "addr": "7741 Via Capri", "zip": "92037", "price": "3995000", "pid": "16852417", "homeSize": "4682", "beds": "5", "state": "CA", "yearBuilt": "1972", "lotSize": "20908", "baths": "5.0", "type": "SingleFamily", "description": "Spanish style modern 5 bedroom home, high end kitchen appliances, hard wood and tile floors, carpeted bedrooms, granite counters through out, butlers pantry with separate sink and refrigerator, sunken family room and dinning room, vaulted ceilings, wired for central music, tropical courtyard with salt water pool, multiple window seats, game room with surround sound plasma big screen, master bath steam sauna, orchard and garden area with separate storage shed, mature tropical landscape. Hydro radiant floor heating, makes for warm floors in the winter time. Ocean breezes cool in the summer time.  Great party/entertaining house.\n\nNeighborhood Description\n\nQuite and peaceful, house is located on a private driveway so very little traffic.\nProperty is priced in a value range of $3,995,000-$4,350,000"}
{"city": "San Diego", "addr": "4369 Witherby St", "zip": "92103", "price": "599000", "pid": "16951338", "homeSize": "858", "beds": "2", "state": "CA", "yearBuilt": "1921", "lotSize": "2300", "baths": "1.0", "type": "SingleFamily"}
{"city": "San Diego", "addr": "4370 Witherby St", "zip": "92103", "price": "1895000", "pid": "16951342", "homeSize": "3216", "beds": "4", "state": "CA", "yearBuilt": "1928", "lotSize": "7000", "baths": "3.5", "type": "SingleFamily"}
{"city": "San Diego", "addr": "3136 N Evergreen St", "zip": "92110", "price": "1300000", "pid": "16968038", "homeSize": "2282", "beds": "3", "state": "CA", "yearBuilt": "1980", "lotSize": "13507", "baths": "3.0", "type": "SingleFamily", "description": "Resort style living awaits you in this luxuriously remodeled Pt. Loma estate. Open concept dining & gourmet kitchen greet you as you step foot in the front door. A generous sized living room opens to your outdoor oasis that offers a black bottom pool, bubbly spa, fire pit, a putting green, & oversized grassy areas perfect for entertaining! Light & bright bedrooms offer a plethora of space & comfort for your loved ones. Not a detail was spared in the spa inspired bathrooms ready for relaxation. A must see! Brokered And Advertised By: Realty National, Inc. Listing Agent: Reshia Guarnotta"}
{"city": "San Diego", "addr": "4135 Tambor Rd", "zip": "92124", "price": "775000", "pid": "16977961", "homeSize": "2221", "beds": "5", "state": "CA", "yearBuilt": "1974", "lotSize": "7100", "baths": "2.25", "type": "SingleFamily", "description": "Living in Tierrasanta is a great. Finding the home with everything you need to live in for next 30 years in Tierrasanta is a BONUS!  This 5 bedroom home has everything you need to raise the family and/or have the grandkids over.  Custom pool, large manicured yard, 5 bedrooms, newly remodeled, and has views from the second story.  On the east side of Tierrasanta on a quiet street, you couldn't ask for a better place to call home.  "}
{"city": "San Diego", "addr": "4777 Rolando Blvd", "zip": "92115", "price": "549000", "pid": "16998092", "homeSize": "1300", "beds": "2", "state": "CA", "yearBuilt": "1928", "lotSize": "5999", "baths": "1.0", "type": "SingleFamily", "description": "Rare opportunity!  This original Rolando Village Spanish Bungalow boasts charm and elegance throughout. Highly sought after cathedral ceiling with exposed hand hewn beams, archways and open layout.  Enjoy dinners in the rustic courtyard off the double french doors or spend your afternoons swimming and barbecuing, followed up relaxing by the built in gas fire pit. Rolando is known for it treelined street, community events and fairs all within walking distance to coffee shops, restaurants, and groceries (Trader Joe's coming in 2016). 2 bed 1 bath, approximately 1300 (144 sqft for optional room permit unknown) sqft based on previous purchase, mls reflects different sqft. Buyer to verify. "}
{"city": "San Diego", "addr": "250 53rd St", "zip": "92114", "price": "319000", "pid": "17087927", "homeSize": "1362", "beds": "4", "state": "CA", "yearBuilt": "1959", "lotSize": "3484", "baths": "2.0", "type": "SingleFamily", "description": "Delightful 4BR 2BA home with plenty of space to satisfy all. A/C, Heating, Garage. Home is currently being prepared to place on market for best showing after May 1st."}
{"city": "San Diego", "addr": "3568 Arruza St", "zip": "92154", "price": "365000", "pid": "17164635", "homeSize": "1396", "beds": "4", "state": "CA", "yearBuilt": "1969", "lotSize": "5700", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Diego", "addr": "11487 Aliento Ct", "zip": "92127", "price": "605000", "pid": "17201870", "homeSize": "1417", "beds": "3", "state": "CA", "yearBuilt": "1976", "lotSize": "8600", "baths": "2.0", "type": "SingleFamily", "description": "Well maintained home. Great use of space. Very private corner lot. ** Please do not disturb occupants *** Contact broker's office and leave a message with any questions. The Kurniadi Group 858-461-8846 ( BRE Lic # 01877767)"}
{"city": "Rialto", "addr": "760 N Belden Ave", "zip": "92376", "price": "230000", "pid": "17227457", "homeSize": "1596", "seller": "Kristina Tolento", "beds": "3", "state": "CA", "yearBuilt": "1968", "lotSize": "8340", "baths": "2.0", "type": "SingleFamily"}
{"city": "SAN BERNARDINO", "addr": "1418 N Arrowhead Ave", "zip": "92405", "price": "249900", "pid": "17233075", "homeSize": "1300", "seller": "Adrian and Diane", "beds": "4", "state": "CA", "yearBuilt": "2015", "lotSize": "7152", "baths": "2.0", "type": "SingleFamily", "description": "We are on the market. Brand new construction. 4 Bedroom 2 bathroom, 1300 sq.ft. Priced at $249,900. Give Adrian & Diane a call or 909-994-8567 or email us @ adriananddiane@gmail.com"}
{"city": "San Bernardino", "addr": "268 E 47th St", "zip": "92404", "price": "200000", "pid": "17244343", "homeSize": "1083", "beds": "2", "state": "CA", "yearBuilt": "1950", "lotSize": "6750", "baths": "1.0", "type": "SingleFamily", "description": "Turn key 2 bedroom 1 bathroom San Bernardino home in a quiet cul de sac."}
{"city": "San Bernardino", "addr": "2582 Belmont Ave", "zip": "92407", "price": "239900", "pid": "17344264", "homeSize": "1365", "seller": "Zoram Luna", "beds": "3", "state": "CA", "yearBuilt": "1988", "lotSize": "7455", "baths": "2.0", "type": "SingleFamily", "description": "Beautiful Move in Ready Verdemont Property located in North San Bernardino! Featuring an open design layout this quaint home comes with an elegant Spanish tile roof, 3 bedrooms, 2 full bathrooms, 2 car garage, and large lot for all your activities. Inside you will find a beautiful formal living room with high ceilings and fireplace for those cool winter nights. Walk into the large kitchen that features high ceilings and charming cabinetry with bar countertops that open to dining area and family room. The new tile in entry, kitchen,and bathrooms adds modern touch to home! Large Master Bedroom comes with master bathroom for additional convenience and privacy! Recently updated energy efficient AC Unit will make sure your house stays nice and cool on those HOT summer nights. Recently painted exterior makes it look clean and modern. Property is located minutes away from Cal State University, Freeways and shopping centers! Act now before its too late!"}
{"city": "San Bernardino", "addr": "5004 Tamarron Ct", "zip": "92407", "price": "239900", "pid": "17352083", "homeSize": "1688", "seller": "Julio Sandoval", "beds": "4", "state": "CA", "yearBuilt": "1993", "lotSize": "7455", "baths": "3.0", "type": "SingleFamily", "description": "Great family home in an excellent community of North San Bernardino!!!\nProperty features: FOUR bedrooms, THREE full bathrooms, family room with fireplace, living/dinning room, open\nconcept kitchen. Built in 1993 in a Modern style and a total of 1,602 of living area. An attached 2 car garage with direct\naccess to property. One bedroom and bath is located on the first floor.\nConveniently located minutes away from Cal State San Bernardino, with a small driving distance to the 215 & 210\nfwys. Schools, shopping centers and parks.\n((( Property is in need of cosmetic repairs; Will need CASH or Conventional Buyer)))"}
{"city": "San Bernardino", "addr": "1807 E San Bernardino Ave", "zip": "92408", "price": "219900", "pid": "17364226", "homeSize": "1576", "seller": "Shobha George", "beds": "3", "state": "CA", "yearBuilt": "1958", "lotSize": "22440", "baths": "2.0", "type": "SingleFamily", "description": "This 1576 square foot single family home has 3 bedrooms and 2.0 bathrooms. It is located at 1807 E San Bernardino Ave San Bernardino, California. For details call Shobha George, Titanium Team at 909-362-4678"}
{"city": "San Bernardino", "addr": "1364 Aurora Ln", "zip": "92408", "price": "212200", "pid": "17364798", "homeSize": "1683", "seller": "Cerise Jennings-Skeen", "beds": "3", "state": "CA", "yearBuilt": "1989", "lotSize": "4336", "baths": "2.5", "type": "SingleFamily", "description": "Cool in the summer, warm in the winter with all new dual-pane windows.  Ceiling Fans in all rooms upstairs. Bonus area upstairs for your computer, table, and chair or for exercise equipment, you choose.  Attached 2 car garage with workbench.  No muss, no fuss yard.  Wet bar for entertaining. "}
{"city": "Riverside", "addr": "11488 Victoria Ave", "zip": "92503", "price": "609000", "pid": "17792717", "homeSize": "2982", "beds": "4", "state": "CA", "yearBuilt": "1989", "lotSize": "46609", "baths": "3.0", "type": "SingleFamily"}
{"city": "Riverside", "addr": "9437 Sage Ave", "zip": "92503", "price": "290000", "pid": "17834318", "homeSize": "1260", "seller": "Michele Campbell", "beds": "3", "state": "CA", "yearBuilt": "1959", "lotSize": "6970", "baths": "1.75", "type": "SingleFamily", "description": "Great home for a first time OR move-up buyer. Single story home on a mature tree lined street, nice large front yard, 3 bedrooms and 2 bathrooms / 2-car garage. Entry leading into living room with tiled fireplace. Kitchen with upgraded cabinets, countertops with an eating area. Ceramic tile flooring throughout living/kitchen areas. Rear yard with covered patio and block wall fencing. *NEW INTERIOR PAINT, CARPET are already complete and NEW APPLIANCES will be installed at COE!"}
{"city": "Riverside", "addr": "2974 Date St", "zip": "92507", "price": "219000", "pid": "17843994", "homeSize": "1003", "beds": "3", "state": "CA", "yearBuilt": "1922", "lotSize": "10454", "baths": "1.5", "type": "SingleFamily", "description": "Newly remodeled will be on the market in may\ncall Rey and Darlene 909-295-1314"}
{"city": "Riverside", "addr": "6484 Nidever Ave", "zip": "92504", "price": "250000", "pid": "17849119", "homeSize": "1668", "beds": "5", "state": "CA", "yearBuilt": "1963", "lotSize": "6970", "baths": "1.75", "type": "SingleFamily", "description": "We have appraisal in!! Perfect now for investor or strong conventional. Needs updating and some TLC. 5 bedroom home, 2 bedrooms with full bath downstairs. Great neighborhood, close to schools and amenities.  Very desirable area, largest floorplan around!!!"}
{"city": "Riverside", "addr": "2991 Carl St", "zip": "92507", "price": "229999", "pid": "17863715", "homeSize": "1054", "beds": "3", "state": "CA", "yearBuilt": "1956", "lotSize": "6970", "baths": "1.0", "type": "SingleFamily", "description": "Great 3 bedroom 1 bath home. Perfect starter home for you. Home is in great and has many desirable features. Large lot with a big backyard complete with covered patio. Bring the kids as this neighborhood is full of children playing and having fun."}
{"city": "Riverside", "addr": "4055 Mt Vernon Ave", "zip": "92507", "price": "480000", "pid": "17866156", "homeSize": "3036", "beds": "4", "state": "CA", "yearBuilt": "1964", "lotSize": "15246", "baths": "2.75", "type": "SingleFamily", "description": "This is the single story pool home you have been waiting for!! It has everything you need and even what you didn't know you needed. Perfect for the Multi-Generational family with two master suite areas with their own entrances. Four bedroom, 3 bath, this home was CUSTOM built in 1964.   2 Central A/C units.  Park like secluded backyard with a sparkling pool and still plenty of grassy area for kids or that volleyball court.  Real RV Parking. One of the suites has an adjacent room for hobbies, living room area if you want to use it as granny quarters or use for more entertaining when enjoying the pool.  Close to great amenities, restaurants, shopping, downtown Riverside, museums, UCR and STEM Academy is within walking distance. "}
{"city": "Riverside", "addr": "20749 Brana Rd", "zip": "92508", "price": "424900", "pid": "17891815", "homeSize": "2540", "seller": "Maria Knorr", "beds": "5", "state": "CA", "yearBuilt": "1991", "lotSize": "6970", "baths": "2.75", "type": "SingleFamily", "description": "This gorgeous 2,540 sq ft. with 5 bedrooms , 2.75 baths home has a BRAND NEW remodeled kitchen with cabinets, granite counter tops, range, microwave, faucet, sink and dimmable canned lighting.  New ceiling fans in all bedrooms and family room.  Newly front and back yard landscaping with water saving eco friendly sprinkler system and extended 4 car drive way, paint inside and out, white vinyl fencing, rain gutters, whole house fan, Wayne Dalton garage doors, upgraded base boards, custom wrought iron with maple wood stair case.  There's a bedroom and bathroom down stairs.  A 2 year old above ground pool with upgraded pump and filter. Garage has storage cabinets, large work bench and a sink.         "}
{"city": "San Jose", "addr": "752 N 4th St", "zip": "95112", "price": "699888", "pid": "19566889", "homeSize": "1382", "beds": "3", "state": "CA", "yearBuilt": "1936", "lotSize": "6969", "baths": "2.0", "type": "SingleFamily", "description": "Beautiful 3 bedroom home located in Japantown.  Central heat & A/C, partial basement, large lot with off-street parking and garage.  Details coming soon! "}
{"city": "San Jose", "addr": "4480 Waimea Ct", "zip": "95118", "price": "798000", "pid": "19699046", "homeSize": "1406", "beds": "3", "state": "CA", "yearBuilt": "1972", "lotSize": "9000", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Jose", "addr": "2085 Calview Ave", "zip": "95122", "price": "459900", "pid": "19726712", "homeSize": "1141", "beds": "3", "state": "CA", "yearBuilt": "1959", "lotSize": "6200", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Jose", "addr": "5996 Gleneagles Cir", "zip": "95138", "price": "1648000", "pid": "19813079", "homeSize": "2981", "beds": "4", "state": "CA", "yearBuilt": "1998", "lotSize": "9225", "baths": "3.5", "type": "SingleFamily", "description": "Rare 1- story home inside the gates of Silver Creek Valley Country Club. This well designed Amalfi floor plan in the prestigious Positano Collection features incredible upgrades and stunning panoramic views. Extensive and rich Travertine limestone and Cherry hardwood flooring, new carpet, full marble master bath & much more. Enjoy the gourmet kitchen with some new appliances and granite counters.  Very light and bright with walls of windows. Builder option 4th bedroom is used and open office. Very flexible floor plan. Lovely and very private yard with no rear neighbors. Live the Good Life at Silver Creek..."}
{"city": "San Jose", "addr": "585 Continental Dr", "zip": "95111", "price": "599900", "pid": "19814094", "homeSize": "1761", "beds": "4", "state": "CA", "yearBuilt": "1958", "lotSize": "5508", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Jose", "addr": "5838 Cohasset Way", "zip": "95123", "price": "648000", "pid": "19827594", "homeSize": "1203", "beds": "3", "state": "CA", "yearBuilt": "1966", "lotSize": "5500", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Jose", "addr": "246 Castillon Way", "zip": "95119", "price": "829000", "pid": "19838876", "homeSize": "1715", "beds": "4", "state": "CA", "yearBuilt": "1967", "lotSize": "6868", "baths": "2.0", "type": "SingleFamily", "description": "Hardwood floors, Recently remodeld, light bright & open floor plan.  Call for a private showing before going on the market!"}
{"city": "Saint Paul", "addr": "201 George St W", "zip": "55107", "price": "259900", "pid": "2052895", "homeSize": "2436", "beds": "5", "state": "MN", "yearBuilt": "1904", "lotSize": "6850", "baths": "3.0", "type": "MultiFamily2To4", "description": "Duplex - Excellent upper level 3 bedroom duplex unit in great west side location. 2 baths with nice 3 season porch in the back - GREAT views of down town St. Paul! Beautiful wood floors, off street parking, near bus line. "}
{"city": "Saint Paul", "addr": "1663 Niles Ave", "zip": "55116", "price": "659000", "pid": "2063262", "homeSize": "3069", "seller": "Colin Miller", "beds": "5", "state": "MN", "yearBuilt": "2014", "lotSize": "5080", "baths": "4.0", "type": "SingleFamily", "description": "Gorgeous Completed New Construction Home! Desired Open Floor Plan Great for Entertaining, Gourmet Kitchen, Luxurious Master Suite, Heated Floor & LED Lights. Fantastic Area Close to Shopping & Restaurants. A lot of Upgraded Items Throughout this Home!"}
{"city": "Virginia Beach", "addr": "472 Adkins Arch", "zip": "23462", "price": "145000", "pid": "2102784922", "homeSize": "1562", "beds": "2", "state": "VA", "baths": "2.0", "type": "SingleFamily"}
{"city": "Portland", "addr": "7047 SE 64th Ave", "zip": "97206", "price": "379900", "pid": "2102787076", "homeSize": "2298", "beds": "3", "state": "OR", "yearBuilt": "2014", "lotSize": "5000", "baths": "3.0", "type": "SingleFamily", "description": "New Construction. Ready to move-in. Beautiful details throughout. Master on the main with office that could be used as fourth bedroom. Three full baths. Bonus room upstairs. "}
{"city": "Portland", "addr": "7035 SE 64th Ave", "zip": "97206", "price": "379900", "pid": "2102787078", "homeSize": "2298", "beds": "3", "state": "OR", "yearBuilt": "2014", "lotSize": "5000", "baths": "3.0", "type": "SingleFamily", "description": "New Construction. Ready to move-in. Beautiful details throughout. Master on the main with office that could be used as fourth bedroom. Three full baths. Bonus room upstairs. "}
{"city": "San Antonio", "addr": "19318 Terra Brook", "zip": "78255", "price": "679000", "pid": "2102797419", "homeSize": "3000", "seller": "Joe Corwin", "beds": "4", "state": "TX", "yearBuilt": "2015", "lotSize": "43560", "baths": "3.0", "type": "SingleFamily", "description": "Luxury gated community in the hills with guarded entry gate and million dollar homes in the area. Gorgeous location at end of a cul-de-sac with incredible views! The build to suit custom four bedroom, three full bathroom home has two master suites, three car garage and upgrades galore to include granite countertops, high ceilings, rock/brick exterior and much more. Can make changes and modifications to the floorplan. Features community center with cascading waterfall pool, clubhouse, tennis courts, walking trails and more. Close to La Cantera, UTSA, USAA, Valero, and The Rim."}
{"city": "san francisco", "addr": "2945 Baker Street #5", "zip": "94123", "price": "425000", "pid": "2102804869", "homeSize": "265", "seller": "Anthony Koutsos", "state": "CA", "yearBuilt": "1915", "baths": "1.0", "type": "Miscellaneous", "description": "Sunny, Remodeled Studio located at the intersection of Cow Hollow, Pac Heights and the Marina. Walk to The Presidio, Chestnut and Union Street Shops, Cafes and Restaurants. Baker at Greenwich is one of the most sought after Locations in the City. Really nice fully remodeled bath. Price is a real price, not a teaser. Seller will re-rent if it doesn't sell April 22nd. Offers reviewed as received."}
{"city": "San Jose", "addr": "1020 Wilsham Drive", "zip": "95132", "price": "749000", "pid": "2102816370", "homeSize": "1600", "beds": "4", "state": "CA", "yearBuilt": "1975", "lotSize": "6000", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Francisco", "addr": "320 Walnut St", "zip": "94118", "price": "3200000", "pid": "2102846056", "homeSize": "3670", "beds": "8", "state": "CA", "baths": "5.0", "type": "MultiFamily2To4"}
{"city": "toledo", "addr": "1122 Evesham", "zip": "43607", "price": "14000", "pid": "2102855532", "homeSize": "1080", "beds": "3", "state": "OH", "yearBuilt": "1938", "lotSize": "30", "baths": "1.0", "type": "SingleFamily", "description": "Great rental unit.  Currently rented $500"}
{"city": "TOLEDO", "addr": "1103 Marmion", "zip": "43607", "price": "8000", "pid": "2102855543", "homeSize": "1668", "beds": "2", "state": "OH", "yearBuilt": "1898", "lotSize": "30", "baths": "2.0", "type": "MultiFamily2To4", "description": "GREAT RENTAL not currently rented. 2 bed per unit."}
{"city": "toledo", "addr": "1527 Tecumseh", "zip": "43607", "price": "13000", "pid": "2102855569", "homeSize": "1510", "beds": "4", "state": "OH", "yearBuilt": "1907", "lotSize": "30", "baths": "1.0", "type": "SingleFamily", "description": "Currently rented $500 a month."}
{"city": "TOLEDO", "addr": "1521 Tecumseh", "zip": "43607", "price": "10000", "pid": "2102855575", "homeSize": "1589", "beds": "3", "state": "OH", "yearBuilt": "1899", "baths": "1.0", "type": "SingleFamily", "description": "GREAT rental house.  Not currently rented.  Husband passed away."}
{"city": "TOLEDO", "addr": "905 Norwood", "zip": "43607", "price": "10000", "pid": "2102855591", "homeSize": "1198", "beds": "3", "state": "OH", "yearBuilt": "1902", "lotSize": "32", "baths": "1.0", "type": "SingleFamily", "description": "CURRENTLY RENTED $500 A MONTH.  HUSBAND PASSED AWAY."}
{"city": "TOLEDO", "addr": "909 Vance", "zip": "43607", "price": "10000", "pid": "2102855623", "homeSize": "1478", "beds": "3", "state": "OH", "yearBuilt": "1892", "lotSize": "35", "baths": "1.25", "type": "SingleFamily", "description": "GREAT investment property.  Husband passed away.  Currently not rented."}
{"city": "San Diego", "addr": "1199 Pacific Highway #304", "zip": "92101", "price": "649900", "pid": "2102857146", "homeSize": "1336", "beds": "2", "state": "CA", "yearBuilt": "2004", "baths": "2.0", "type": "Condominium", "description": "This gorgeous condo in the prized Grande South is just what you've been waiting for! Imagine views of the picturesque Santa Fe Depot! Highlights include wood floors, a granite and stainless-steel kitchen, breakfast bar, floor-to-ceiling windows, a private terrace, and much more! "}
{"city": "San Diego", "addr": "500 W Harbor Drive #807", "zip": "92101", "price": "454500", "pid": "2102857174", "homeSize": "879", "beds": "1", "state": "CA", "yearBuilt": "1994", "baths": "1.0", "type": "Condominium", "description": "Light and bright, this wonderful condo features marble floors in the entry and bathroom, granite surfaces, a fireplace in the living room, and a private terrace boasting city views! CityFront amenities are phenomal, complete with two pools/spas, a fitness center with aerobics room, a lovely recreation room, lavish lobby and salon, and 24-hour concierge/security. Walk to a multitude of restaurants, shops, and entertainment venues from this prime location! Welcome home! "}
{"city": "Tampa", "addr": "10020 Woodlawn St", "zip": "33606", "price": "341850", "pid": "2102876460", "homeSize": "2203", "seller": "Home Seekers Tampa Bay", "beds": "4", "state": "FL", "yearBuilt": "2015", "lotSize": "5000", "baths": "3.0", "type": "SingleFamily", "description": "New Single Family Home featuring 4 bedrooms, 3 bath, den, dining room, family room, gourmet kitchen with 42\" cabinets, granite countertops, stainless appliances, breakfast area, master suite with garden bath, garden tub, separate shower, large walk in closets, nice sized secondary bedrooms, covered lanai, detached 2 car garage. ALL IN THE PLANT HIGH SCHOOL DISTRICT UNDER $400K! CALL HOME SEEKERS TODAY 813-841-2795!! Won't Last Long...**Prices & Availability Subject to change without notice. Picture shown of previous finished home this home is under construction Ready Soon! Floor plan, more pictures and showing available upon request! CALL TODAY!"}
{"city": "Tampa", "addr": "15110 Lemon St", "zip": "33606", "price": "344490", "pid": "2102979064", "homeSize": "2410", "seller": "Home Seekers Tampa Bay", "beds": "4", "state": "FL", "yearBuilt": "2015", "lotSize": "500", "baths": "3.5", "type": "Townhouse", "description": "BRAND NEW SOUTH TAMPA TOWN HOME 4 bedroom, 3 1/2 bath, 2 car garage, screened patio enclosure, larger spacious Kitchen featuring: 42\" cabinets, granite counters, kitchen island, stainless appliances, Refrigerator, front load washer/dryer, tile wet areas, 2\" wood blinds, volume ceilings, breakfast bar. Crown molding, den, family room, Master bedroom & master bath with dual vanities, large walk in closet Block construction all the way up to create sound barrier to decrease noise neighbors. Energy Efficient! CALL HOME SEEKERS TODAY 813-841-2795. **Prices and availability subject to change without notice."}
{"city": "Tampa", "addr": "4211 Jules Drive", "zip": "33611", "price": "625990", "pid": "2102995897", "homeSize": "3173", "seller": "Home Seekers Tampa Bay", "beds": "4", "state": "FL", "yearBuilt": "2015", "lotSize": "5565", "baths": "3.5", "type": "SingleFamily", "description": "New Construction, Steps from Bayshore! 4 bedroom 3 1/2 bath, Gourmet Kitchen:  42' cabinets, granite, gas, stainless appliance package, Wall oven, Refrigerator, eat in kitchen area, pantry, formal dining, spacious family room, master suite, garden bath, dual vanities w/separate shower, walk in closets, & More... (PLANT HS DISTRICT) Luxury features from a Luxury Home Builder. Energy Efficient! CALL HOME SEEKERS TODAY FOR AN APPOINTMENT & INFO TO SEE THIS HOME 813-841-2795. Floor Plan Available. Home still under construction Ready May! ***Prices subject to change without notice. Builder to verify specs."}
{"city": "Rochester", "addr": "360 Thurston Road", "zip": "14619", "price": "139900", "pid": "2103008373", "seller": "Mark Updegraff", "state": "NY", "yearBuilt": "1925", "lotSize": "3416", "type": "Miscellaneous", "description": "Unique income opportunity near U of R! Upcoming commercial district, new streets, sidewalks, curbs and lights. Property includes 4 BR apartment with two commercial storefronts. Surrounding area is grant-eligible for residential, with lots of revitalization to push up values. Off street parking. Storefronts include a large bar with custom woodwork and plenty of seating and full kitchen. Negotiable, available for lease."}
{"city": "Portland", "addr": "1930 Sw River Dr #W906", "zip": "97201", "price": "520000", "pid": "2103012146", "homeSize": "1033", "beds": "1", "state": "OR", "yearBuilt": "2006", "baths": "1.0", "type": "Condominium", "description": "Premiere SW corner unit w/views of the West hills, City and Willamette River. Come LIVE THE LIFE of the Strand at Portland's downtown waterfront. True bedroom plus Den/Flex space. Open floor plan, hardwoods, deeded parking & storage. Chef's kitchen w/ island, granite counter tops & high end SS appliances. Secure parking & Concierge service. Close to hotels, restaurants, shops, Keller Auditorium, OHSU and streetcar.\n"}
{"city": "San Bernardino", "addr": "6102 Mckinley Ave.", "zip": "92404", "price": "282500", "pid": "2103045740", "homeSize": "1681", "seller": "Gina Ibarra", "beds": "4", "state": "CA", "yearBuilt": "1964", "lotSize": "9125", "baths": "2.0", "type": "SingleFamily", "description": "This home is ready for summer with it's built in pool and diving board that will captivate an audience. Nice size backyard with covered patio will be the hang out this summer. This 4 bedroom home has pride of ownership, with custom made kitchen cabinets that have pull outs for easy access along with upgraded corian counters. Kitchen Opens to the Family room with fireplace and built in book shelves, glass slider brings in the light and is the gateway to the fun filled back yard that I mentioned earlier, awaiting your arrival. There is one Jack and Jill bathroom and one bath room attached to the master bedroom that has a door out to the pool for those late night swims. Enjoy all the hall storage that this home comes with, as well as whole house fan, attic fan, and newer vinyl windows, all to help with energy savings. FYI, Security system in place Protection One, is 47.99 a month."}
{"city": "St Petersburg", "addr": "3971 New Uptown", "zip": "33701", "price": "297500", "pid": "2103526257", "homeSize": "1739", "seller": "Home Seekers Tampa Bay", "beds": "3", "state": "FL", "yearBuilt": "2015", "lotSize": "1100", "baths": "2.5", "type": "SingleFamily", "description": "Brand new Townhome close to downtown. LIMITED TIME SPECIAL INCENTIVE special amount of  FREE OPTIONS AVAILABLE ONLY until 4/17/2015! JUST (9) townhomes still  available!! Don't Miss Out CALL HOME SEEKERS TAMPA BAY TODAY 813-841-2795!\n13 units total with detached garage, pavered front entry and courtyard. Balcony off master suite. Block construction all the way up. 42\" cabinets, granite, stainless appliance package,  excellent finishes through out ability to still choose colors and designs at this time. Energy Efficient. Design & Construction Features  more details provided upon request call Home Seekers for info!  ***Prices subject to change without notice. Pre-Construction Pricing is shown and increasing soon. Builder to verify specs. These units are shown by appointment only. "}
{"city": "Saint Paul", "addr": "2079 Stanford Ave", "zip": "55105", "price": "675000", "pid": "2105057862", "homeSize": "3137", "seller": "Colin Miller", "beds": "5", "state": "MN", "yearBuilt": "2014", "lotSize": "5009", "baths": "4.0", "type": "SingleFamily", "description": "Brand New Custom Built New Construction Home. Desired Floor Plan Great for Entertaining & a Luxurious Master Suite & Gourmet Kitchen. Large Attached Garage with Breezeway & Mudroom. Paver Patio & Privacy Fence. Lots of Upgraded Items Throughout this Home!"}
{"city": "Saint Paul", "addr": "1408 Arlington Ave W", "zip": "55108", "price": "239900", "pid": "2110537", "homeSize": "1468", "beds": "4", "state": "MN", "yearBuilt": "1950", "lotSize": "10890", "baths": "2.0", "type": "SingleFamily"}
{"city": "San Diego", "addr": "3845 Kendall St APT D", "zip": "92109", "price": "479000", "pid": "2110582655", "homeSize": "1017", "beds": "2", "state": "CA", "yearBuilt": "1973", "baths": "1.0", "type": "Condominium", "description": "Location, Location, Location. Pacific Beach is a great place to call home and this upgraded condo is 1/2 a block to Pacific Beach's incredible Crown Point Beach, Bay, and grassy park. Top floor, end unit in 4 unit complex. Light and bright, open floor plan and large rooms. Updated kitchen with gorgeous cabinets and granite counters. Brand new flooring, new windows, updated bathroom. Your own private garage, and full sized washer and dryer in unit.  Low, low, low HOA fees only $150/mth. 100% owner occupancy!. Common area with grass and patio space for barbeque.  Under 500k? Why pay rent? Pet's ok!"}
{"city": "Saint Paul", "addr": "1561 Albany Ave", "zip": "55108", "price": "209000", "pid": "2110936", "homeSize": "1567", "seller": "Colin Miller", "beds": "3", "state": "MN", "yearBuilt": "1890", "lotSize": "7840", "baths": "2.0", "type": "SingleFamily", "description": "Nicely Renovated 2 Story Home in a Great Como Neighborhood. Brand New Roof, Furnace, Kitchen, Baths, Carpet, Paint, Tile, Appliances & a New 2 Car Garage! Newer Windows, Maintenance Free Vinyl Siding, Large Deck & Porch with an Over-Sized City Lot Too!\n"}
{"city": "Saint Louis", "addr": "5804 Westminster Pl", "zip": "63112", "price": "324900", "pid": "2111796189", "homeSize": "2256", "beds": "3", "state": "MO", "lotSize": "6599", "baths": "3.0", "type": "Miscellaneous", "description": "Amazing opportunity to build your dream home in a great neighborhood, close to all of the attractions of Forest Park and the Central West End! New construction pricing starting at $324,900 with the option to upgrade and customize to your liking. Your 3 bedroom 2.5 bath includes an open floor plan, master bedroom suite with double vanity, hardwood floors, 9Ft ceilings, large deck and a  2 car garage. **Lots 5806 & 5808 Westminster Place will also be available soon! "}
{"city": "Rochester", "addr": "1506 Dewey Ave", "zip": "14615", "price": "89900", "pid": "2114557249", "homeSize": "5400", "seller": "Donna Cornell", "beds": "3", "state": "NY", "yearBuilt": "1930", "baths": "4.0", "type": "MultiFamily2To4", "description": "2/2 bedroom apartments above bring in 1150.00 per month and lower part can be any business you desire. Many possibilities. Busy area by Ridgeway Ave."}
{"city": "Saint Paul", "addr": "284 Pelham Blvd", "zip": "55104", "price": "749000", "pid": "2145956", "homeSize": "4800", "beds": "5", "state": "MN", "yearBuilt": "1925", "lotSize": "10018", "baths": "4.0", "type": "SingleFamily", "description": "CHARMING 3-STORY TUDOR--best urban location in the Twin Cities!\nFront overlooks Miss. River; back overlooks TOWN & COUNTRY golf course! Walk to University of St. Thomas, University of Minnesota, Longfellow neighborhood. Mississippi River Blvd is out your front door! 5 minutes to Grand Avenue shops. 8 minutes to downtown Minneapolis and St. Paul! 10 minutes to the airport.\nNeighborhood has tree-lined streets and an 'air of grandeur'. You'll love living here. Location and setting is everything!"}
{"city": "Tampa", "addr": "3817 W Obispo St", "zip": "33629", "price": "650000", "pid": "2146489738", "beds": "5", "state": "FL", "baths": "3.0", "type": "SingleFamily", "description": "NEW PHOTOS AND VIDEO TOUR POSTED SOON!!\n\nINQUIRE FOR MORE DETAILS!"}
{"city": "Tulsa", "addr": "5810 S Atlanta Ave", "zip": "74105", "price": "189000", "pid": "22168609", "homeSize": "1809", "seller": "Terry Gobbo", "beds": "2", "state": "OK", "yearBuilt": "1978", "lotSize": "653400", "baths": "2.5", "type": "SingleFamily", "description": "Deal Fell!!! Everything is DONE!!! Immaculate end unit Condo backs to tennis court with pond views in South Shore! Updated kitchen with new appliances, new paint and new lighting. Updated Spa Baths in both bedrooms. Master Bedroom with sitting area, balcony, and his/her closets. 24 Hr. Guard at Gate!"}
{"city": "Santa Ana", "addr": "917 S Flower St", "zip": "92703", "price": "525000", "pid": "25094832", "homeSize": "1806", "seller": "Anderson Real Estate Group", "beds": "4", "state": "CA", "yearBuilt": "1930", "lotSize": "6098", "baths": "3.0", "type": "SingleFamily", "description": "Lovingly remodeled, welcome home to 917 S. Flower Avenue. An inviting walkway and front landscaping leads you to the charming front porch. Enter to an open integrated living and dining room with tall ceilings and gorgeously figured laminate flooring. The open kitchen has been updated with sparkling granite counters atop plentiful wooden cabinets and generously sized low maintenance tile floors. This special home is amazingly expansive and lives as a very desirable three bedroom, two bathroom homeinclusive of a large master suite perfect for relaxing. Each of the bedrooms is flooded with natural light from the many windows and is so comfortable from the plush carpeting; the bathrooms have been updated with newer cocoa vanities, attractive brushed nickel hardware, and warm custom stone tile shower surrounds. As if this were not enough, there is a private rear space with separate meters for gas and electricity, which could be perfect for guests! Parking is never a concern as a very long driveway leads you to a large two car garage. To complete this perfect package is an expansive rear yard with large patio perfect for summer barbequesstart a lifetime of happy memories within your nearly new home today! For more information, please call us at 800.784.2616 EXT 212."}
{"city": "Santa Ana", "addr": "1714 S Van Ness Ave", "zip": "92707", "price": "340000", "pid": "25099264", "homeSize": "862", "beds": "2", "state": "CA", "yearBuilt": "1938", "lotSize": "6098", "baths": "1.0", "type": "SingleFamily", "description": "Cute home in nice neighborhood.. This will qualify for  Neighborhood Stabilization Program (NSP-2) Down Payment Assistance of up to $80,000.  Contact listing agent for details."}
{"city": "Sacramento", "addr": "5261 80th St", "zip": "95820", "price": "169900", "pid": "25815484", "homeSize": "1147", "seller": "Justin & Geneen Sherrets", "beds": "3", "state": "CA", "yearBuilt": "1957", "lotSize": "5662", "baths": "2.0", "type": "SingleFamily", "description": "Well cared for three bedroom, two bath on quiet street.  Central heat and a/c. Cozy brick fireplace in family room. Security system. The garage is insulated for year round comfort and has tons of storage along with a built-in work bench."}
{"city": "Sacramento", "addr": "6850 Harmon Dr", "zip": "95831", "price": "375000", "pid": "25826107", "homeSize": "1606", "seller": "Jake Worley", "beds": "3", "state": "CA", "yearBuilt": "1975", "lotSize": "7840", "baths": "2.0", "type": "SingleFamily", "description": "LIGHT AND BRIGHT FEEL TO THIS GREENHAVEN HOME,3 BEDROOMS 2 BATHROOMS,PLENTY OF STORAGE WITH MANY BUILT IN CABINETS,LARGE FAMILY ROOM WITH FIREPLACE AND A SEPERATE LIVING ROOM, BOTH BATHROOMS HAVE BEEN UPDATED, THE GUEST BATHROOM HAS A JETTED TUB.THE HOME HAS CENTRAL HEAT AND AIR, DUAL PANE WINDOWS,LAMINATE WOOD FLOORING THROUGHOUT MOST OF THE HOUSE,NEWER ROOF, LARGE BACKYARD, DIDION SCHOOL DISTRICT, WHAT MORE COULD YOU ASK FOR? CALL FOR A SHOWING TODAY"}
{"city": "Sacramento", "addr": "365 Cedar River Way", "zip": "95831", "price": "469000", "pid": "25828577", "homeSize": "2386", "beds": "4", "state": "CA", "yearBuilt": "1985", "lotSize": "8165", "baths": "2.5", "type": "SingleFamily", "description": "Quality custom one story ranch style home built by Willis Watkins.  This home has been lovingly maintained and updated by the original owners.  It is a modified \"stardust\" plan with nice big rooms.  The kitchen and bathroom have been remodeled.\n"}
{"city": "Sacramento", "addr": "1177 Rio Royal Way", "zip": "95834", "price": "235000", "pid": "26015059", "homeSize": "1336", "seller": "Darren Soares", "beds": "3", "state": "CA", "yearBuilt": "1985", "lotSize": "4356", "baths": "2.5", "type": "SingleFamily", "description": "This wonderful and recently updated two story home is ready for you to move in. New kitchen cabinets, stove, dishwasher, and sink. New flooring, new exterior and interior paint, new roof, and a new garage door. This great home features 3 bedrooms, 2.5 bathrooms, 2 car garage, and a lovely backyard. Come and take a look at this property for yourself, It won't last long!"}
{"city": "Sacramento", "addr": "3817 Fig St", "zip": "95838", "price": "139000", "pid": "26057974", "homeSize": "1091", "seller": "Anna Chi Huang", "beds": "3", "state": "CA", "yearBuilt": "1959", "lotSize": "6098", "baths": "1.0", "type": "SingleFamily", "description": "WARM & COZY home for sale with 3 bedrooms and 1 full bathrooms, updated kitchen with newer cabinets, granite countertops and much more, spacious backyard."}
{"city": "Sacramento", "addr": "3712 Dayton St", "zip": "95838", "price": "109900", "pid": "26059697", "homeSize": "1131", "beds": "3", "state": "CA", "yearBuilt": "1949", "lotSize": "7405", "baths": "1.0", "type": "SingleFamily"}
{"city": "San Antonio", "addr": "9111 Ridge Post", "zip": "78250", "price": "148000", "pid": "26445722", "homeSize": "1641", "seller": "Pro Realty Group", "beds": "3", "state": "TX", "yearBuilt": "1993", "lotSize": "7080", "baths": "2.0", "type": "SingleFamily"}
{"city": "Plano", "addr": "3204 Brookshire Dr", "zip": "75075", "price": "250000", "pid": "26601149", "homeSize": "2292", "beds": "4", "state": "TX", "yearBuilt": "1974", "baths": "2.5", "type": "SingleFamily"}
{"city": "Richardson", "addr": "1607 Rainbow Dr", "zip": "75081", "price": "240000", "pid": "27178490", "homeSize": "2034", "seller": "Julie Cothran", "beds": "4", "state": "TX", "yearBuilt": "1978", "lotSize": "8751", "baths": "2.5", "type": "SingleFamily", "description": "BEAUTIFULLY RENOVATED home in great location! This home offers, granite in kitchen and baths, laminate wood flooring through out living areas, WB fireplace, lots of storage, and a wet bar. The 2nd living area could be large 4th bedroom with French Doors out to the back yard. Just minutes from Hwys 75 & 190, Dart stations and the new Cityline development. Come see this one before its gone!"}
{"city": "Richardson", "addr": "1714 Drake Dr", "zip": "75081", "price": "220000", "pid": "27178693", "homeSize": "2552", "seller": "Julie Cothran", "beds": "3", "state": "TX", "yearBuilt": "1978", "lotSize": "10751", "baths": "3.0", "type": "SingleFamily", "description": "Come make this University Estates home your own! In need of some TLC but with this great floor plan anything is possible. 3 bedrooms, 2 and half bath with 3 great sized living areas. This home sits on a corner lot with mature trees in a VERY DESIRABLE neighborhood. Duck Creek location - minutes from Hwys 75 & 190, Dart stations and the new Cityline development. Home is being SOLD AS IS, homeowner cant make any repairs."}
{"city": "Rochester", "addr": "343 Birr St", "zip": "14613", "price": "59900", "pid": "30851581", "homeSize": "1591", "beds": "4", "state": "NY", "yearBuilt": "1913", "lotSize": "5358", "baths": "1.0", "type": "SingleFamily", "description": "Nicely maintained home with plenty of period characteristics.  Natural woodwork, hardwood floors, huge foyer could be an extra room for an office or study. New tear off roof 2015. New hot water tank 2014. Formal dining room, eat in kitchen with appliances included. Washer and dryer. Thermopane windows. Call Ellen Carr at 733-6252 for more information."}
{"city": "Rochester", "addr": "33 Mount Vernon Ave", "zip": "14620", "price": "99900", "pid": "30887035", "homeSize": "815", "seller": "Mark Updegraff", "beds": "1", "state": "NY", "yearBuilt": "1890", "lotSize": "4791", "baths": "1.0", "type": "SingleFamily", "description": "Bungalow/ranch style home in desirable neighborhood. Seller is fiduciary acting under Power of Attorney for owner. NO Property Condition Disclosure will be provided as seller has no prior knowledge. House is being sold as-is where-is. Unusually large rear yard, fully enclosed. Beautifully planted and landscaped at one time, needs restoration. Home features hardwood floors, newer high efficiency furnace, updated electrical, newer vinyl replacement windows, newer roof. There is a 3-season porch/addition off kitchen. Buyer or Buyer's agent responsible for verification of taxes."}
{"city": "Rochester", "addr": "185 Caroline St", "zip": "14620", "price": "129900", "pid": "30888208", "homeSize": "1334", "seller": "Mark Updegraff", "beds": "3", "state": "NY", "yearBuilt": "1870", "lotSize": "7275", "baths": "1.0", "type": "SingleFamily", "description": "A beautiful home in the South Wedge with lots of upgrades - new plumbing and electric, new roof (house and garage), restored original wainscotting, refinished hardwoods, windows, seamless gutters, insulation. The house has been repainted within the last year (interior and exterior). There is a fully-fenced backyard with blooming apple and pear trees as well as strawberry, elderberry, blackberry and raspberry bushes! First showing will take place from 2 to 3 p.m on Thursday (March 26) only."}
{"city": "Washington", "addr": "5329 Hayes St NE", "zip": "20019", "price": "249900", "pid": "35725736", "homeSize": "1411", "beds": "3", "state": "DC", "yearBuilt": "1916", "lotSize": "5000", "baths": "2.0", "type": "SingleFamily"}
{"city": "Washington", "addr": "548 14th St SE", "zip": "20003", "price": "749900", "pid": "425527", "homeSize": "1920", "seller": "Joel Nelson", "beds": "3", "state": "DC", "yearBuilt": "1906", "lotSize": "1468", "baths": "3.0", "type": "SingleFamily", "description": "Renovated Federal features a wide-open main floor plan with expansive kitchen overlooking intimate back porch and brick patio with secured off-str parking beyond. Upstairs 2 Master suites and sleek skylights and to brighten your day! Finished lower level space flexible for bedroom, home office or family room w laundry and bath at rear entrance dr. Ask about $500 from KVS Title. OPEN SUNDAY 2-4P."}
{"city": "Washington", "addr": "4411 Volta Pl NW", "zip": "20007", "price": "1075000", "pid": "434477", "homeSize": "1784", "beds": "5", "state": "DC", "yearBuilt": "1931", "lotSize": "1636", "baths": "4.0", "type": "Townhouse"}
{"city": "Washington", "addr": "3724 Ingomar St NW", "zip": "20015", "price": "1595000", "pid": "449344", "homeSize": "4100", "beds": "7", "state": "DC", "yearBuilt": "1920", "lotSize": "5143", "baths": "4.5", "type": "SingleFamily", "description": "Vintage 1920's Center Hall, Shingle Colonial. Expansive 7 Bedroom, 4.5 Bath home on charming azalea lined  street. 28 ft. living room features french doors leading to lovely side porch and back yard with patio. Two bedroom au pair/in-law suite in basement with kitchen, living room, washer/dryer, bathroom. Attic features large playroom/living room leading out to 3rd floor deck and separate guest room and bathroom.\nHigh ceilings, Large windows overlooking trees, warm hardwoods. Porches, decks, and 1 Car detached Garage. Beautiful Home!"}
{"city": "Tampa", "addr": "205 N Macdill Ave", "zip": "33609", "price": "275000", "pid": "45096086", "homeSize": "1600", "beds": "3", "state": "FL", "yearBuilt": "1962", "lotSize": "6426", "baths": "2.0", "type": "SingleFamily", "description": "NEW PHOTOS AND VIDEO TOUR COMING SOON!\n\nINQUIRE FOR MORE DETAILS!"}
{"city": "Tampa", "addr": "2912 N Ola Ave", "zip": "33602", "price": "124950", "pid": "45105578", "homeSize": "1404", "beds": "3", "state": "FL", "yearBuilt": "1970", "lotSize": "10454", "baths": "2.0", "type": "SingleFamily", "description": "This beautiful 3/2 opens to a carpeted living area and a tiled dining area. Just off the dining area is the kitchen that comes equipped with a refrigerator. Office next to kitchen has a walk out to back patio and private parking area that overlooks a back yard. Master bedroom has an ensuite bath with glass paneled french doors, and a shower and tub combo. Secondary bedrooms are generously sized and carpeted, as well as share a full bath with a shower and tub combo."}
{"city": "Saint Petersburg", "addr": "379 47th Ave N APT 101", "zip": "33703", "price": "47900", "pid": "47001899", "homeSize": "765", "seller": "Maggie Caceres", "beds": "2", "state": "FL", "yearBuilt": "1973", "baths": "1.0", "type": "Condominium"}
{"city": "Saint Petersburg", "addr": "5908 33rd Ave N", "zip": "33710", "price": "199900", "pid": "47024815", "homeSize": "1803", "beds": "3", "state": "FL", "yearBuilt": "1970", "lotSize": "7501", "baths": "3.0", "type": "SingleFamily", "description": "GREAT \"Sheryl Manor\" neighborhood; RARE 3rd-Bath; \"Split Bedroom Plan\", TWO \"ensuite Master Bedrooms\", would work very well for \"Mom & Dad\", teenagers, room-mates, etc. in shared living arrangements to afford each maximum privacy...\"Wheelchair accessible\" bath in one of the \"Ensuite Bedrooms\"...updated windows throughout...Sellers will not re-paint, etc. but will be flexible and negotiable accordingly,,,"}
{"city": "Saint Petersburg", "addr": "4501 28th Ave N", "zip": "33713", "price": "140000", "pid": "47045588", "homeSize": "948", "seller": "Troy Walseth", "beds": "2", "state": "FL", "yearBuilt": "1953", "lotSize": "13416", "baths": "2.0", "type": "SingleFamily"}
{"city": "Saint Petersburg", "addr": "5601 9th Ave N", "zip": "33710", "price": "132500", "pid": "47094193", "homeSize": "1213", "seller": "Steven Michalski", "beds": "3", "state": "FL", "yearBuilt": "1953", "lotSize": "7973", "baths": "1.0", "type": "SingleFamily", "description": "3/1/1 Very open and spacious home with newer windows and updated bathroom.Move in ready just bring your toothbrush. Includes gleaming terrazzo flooring thru-out. Vaulted ceilings in the living room.The charming kitchen is retro mid-century with stainless appliances Large Corner fenced lot provides easy alley access and privacy . Nice patio to host BBQ's and entertain friends .Corner lot with plenty of parking. A great buy in a very convenient area of St. Pete. Close to beaches, churches, schools and shopping. Act fast !!! Up to $500 for home warranty with full price offer."}
{"city": "St Petersburg", "addr": "672 59th St S", "zip": "33707", "price": "110000", "pid": "47133518", "homeSize": "864", "beds": "3", "state": "FL", "yearBuilt": "1958", "lotSize": "5624", "baths": "1.0", "type": "SingleFamily", "description": "NEW PHOTOS AND VIDEO TOUR POSTED SOON!\n\nINQUIRE FOR MORE INFO!"}
{"city": "Seattle", "addr": "344 N 78th St", "zip": "98103", "price": "750000", "pid": "48651984", "homeSize": "2437", "seller": "Doron Weisbarth", "beds": "4", "state": "WA", "yearBuilt": "1920", "lotSize": "4000", "baths": "2.5", "type": "SingleFamily", "description": "MOVE UP TO THIS HOME AND I'LL SELL YOURS FOR FREE! \nStorybook craftsman, light & bright, old world charm with all the updates. Views of the Cascades, Walkscore 88 to all the fun stores, bars, pubs and cafes on Greenwood and other PhinneyWood delights . Open floor main with 2 bedrooms and full bath. Large, updated kitchen, SS appliances & granite slab with eating bar. Spacious, private backyard with large covered patio, perfect for entertaining even on rainy days. Huge master suite on top floor with views, large walk-in closet, lots of storage & gorgeous bath with his and hers sinks. Finished basement with 2nd kitchen, perfect family room and potential MIL. 2nd garage off alley could also be shop. The good life starts here!\n\nAsk about the recent home inspection and sewer scope reports that are available. "}
{"city": "Washington", "addr": "5127 3rd St NW", "zip": "20011", "price": "634990", "pid": "487684", "homeSize": "1993", "seller": "Brad Griffin", "beds": "4", "state": "DC", "yearBuilt": "1936", "lotSize": "1561", "baths": "3.5", "type": "Townhouse", "description": "Stunning renovation on a quiet tree lined street. 4 bedrooms, 3 1/2 bath, large kitchen, full-walk out basement, hardwood floors, and back yard with parking. All this and less than a mile walk to Metro. Features hardwood floors, brand new and energy efficient appliances, water heater, and HVAC system. New plumbing ,electrical, and roof. Must see.\n\nAgent has a financial interest in this property."}
{"city": "Seattle", "addr": "14357 Bagley Ave N", "zip": "98133", "price": "294900", "pid": "48938777", "homeSize": "1630", "seller": "Keith Bruce", "beds": "3", "state": "WA", "yearBuilt": "1952", "lotSize": "7658", "baths": "1.5", "type": "SingleFamily", "description": "Great 3 bed 1.5 bath corner lot home is waiting for you to make it your own. With a little TLC this home will sparkle. Lots of space with living room, family room, three beds, plus loft. Living room features hardwood floors and wood burning fireplace. Galley kitchen leads to open family room with half bath. Spacious backyard with large patio for entertaining and detached garage. Convenient to highways and public transportation. This is a Fannie Mae Homepath home."}
{"city": "Seattle", "addr": "6232 2nd Ave NW", "zip": "98107", "price": "500000", "pid": "49125967", "homeSize": "1040", "seller": "John Manning", "beds": "3", "state": "WA", "yearBuilt": "1912", "lotSize": "5000", "baths": "1.0", "type": "SingleFamily"}
{"city": "San Diego", "addr": "16750 Summit Vista Dr", "zip": "92127", "price": "1079000", "pid": "51082316", "homeSize": "3900", "beds": "5", "state": "CA", "yearBuilt": "2003", "lotSize": "7044", "baths": "3.0", "type": "SingleFamily", "description": "Coming Soon "}
{"city": "Washington", "addr": "4500 Clay St NE", "zip": "20019", "price": "330000", "pid": "511385", "homeSize": "1674", "beds": "4", "state": "DC", "yearBuilt": "1945", "lotSize": "5188", "baths": "3.5", "type": "SingleFamily", "description": "OPEN HOUSE SATURDAY 4/11 from 1pm - 3pm!\n\n4 bedroom 3.5 bath with off-street parking! Gleaming hardwoods & beautiful mill work. Kitchenette & full bathroom in basement with private entrance. Covered porch on the side of the house overlooks a large yard perfect for entertaining! Excellent opportunity for a primary residence or an investment property. New gutters, soffit, downspouts, and exterior paint. Minutes from Benning Rd Metro stop!"}
{"city": "Portland", "addr": "12618 SE Lincoln Ct", "zip": "97233", "price": "195000", "pid": "53831010", "homeSize": "860", "beds": "3", "state": "OR", "yearBuilt": "1950", "lotSize": "13000", "baths": "2.0", "type": "SingleFamily"}
{"city": "Portland", "addr": "1806 SE 50th Ave", "zip": "97215", "price": "435000", "pid": "53876899", "homeSize": "1400", "beds": "3", "state": "OR", "yearBuilt": "2015", "lotSize": "15000", "baths": "3.5", "type": "Condominium"}
{"city": "Portland", "addr": "12808 SE Lincoln St", "zip": "97233", "price": "249900", "pid": "53911022", "homeSize": "1700", "seller": "Natasha Ochs & Deawn Seals", "beds": "4", "state": "OR", "yearBuilt": "1979", "lotSize": "12197", "baths": "2.0", "type": "SingleFamily", "description": "THIS HOME SITS OFF THE ROAD AND THE BACK OF A CUL DE SAC. VERY PRIVATE, LARGE LOT WITH WATER FEATURE AND GREAT TREES. HOME IS VERY WARM AND INVITING, OPEN FLOOR PLAN, TASTEFUL UPDATES. MASTER HAS PRIVATE BATH! ONE BEDROOM AND FAMILY ROOM SEPARATE, OPENING TO BACK YARD. A FABULOUS HIDDEN GEM! OPEN SAT 5/22 1-4!"}
{"city": "Portland", "addr": "115 N Ainsworth St", "zip": "97217", "price": "425000", "pid": "53933852", "homeSize": "2148", "beds": "4", "state": "OR", "yearBuilt": "1927", "lotSize": "4791", "baths": "2.0", "type": "SingleFamily", "description": "Relax on the grand porch of your gorgeous restored craftsman in the heart of the Piedmont Neighborhood.  Lots of room in this 3BR/2BA home, with a large bonus room which is a perfect office, media room, or 4th non-conforming bedroom.  Enjoy breakfast in the sunny kitchen with steel appliances and custom island cooktop which leads into the fully fenced back and front yards.  Gleaming hardwood floors and details full of character.  Living room with gas firelpace and wired for surround sound.  Updated systems and unfinished basement with plenty of storage.  Close to Peninsula Park, New Seasons, Coffee, Restaurants, and more!\n\n"}
{"city": "Portland", "addr": "1048 SW Myrtle Dr", "zip": "97201", "price": "1174900", "pid": "53949316", "homeSize": "3944", "beds": "3", "state": "OR", "yearBuilt": "1965", "lotSize": "9147", "baths": "4.5", "type": "SingleFamily"}
{"city": "Portland", "addr": "10005 N Tioga Ave", "zip": "97203", "price": "269900", "pid": "53992834", "homeSize": "1507", "seller": "Justin Green", "beds": "4", "state": "OR", "yearBuilt": "1955", "lotSize": "5000", "baths": "2.0", "type": "SingleFamily", "description": "SPECIAL OFFER VALID this weekend only 3/28-29 Final Purchase price $260-262K.\nWonderful one level mid century ranch. 4 Bed 2 bath. Fully fenced back yard with covered patio. Large vinyl windows throughout lets in plenty of natural light. Great Neighborhood blocks to trendy downtown St Johns. New roof to be installed, buyers choice of color. New heaters and Original Hardwood floors."}
{"city": "Reno", "addr": "4615 Edmonton Dr", "zip": "89511", "price": "415000", "pid": "55326961", "homeSize": "2609", "seller": "The Silverman Team", "beds": "3", "state": "NV", "yearBuilt": "2000", "lotSize": "13068", "baths": "3.0", "type": "SingleFamily", "description": "Wonderful home in the Mt Rose area, near shopping and amenities. Light bright, wide opening living spaces perfect for entertaining. Large master on main level with spa like bath and walk in closet. Loft is spacious and light and can be used as an office, playroom or could be converted to 4th bedroom. Fully landscaped yard will feel as if you were strolling in a park with waterfall, pond and gorgeous mature trees. Shed is fully finished and currently utilized as a hobby workshop."}
{"city": "Reno", "addr": "3512 Painted Vista Dr", "zip": "89511", "price": "579000", "pid": "55327116", "homeSize": "2791", "beds": "3", "state": "NV", "yearBuilt": "2002", "lotSize": "13503", "baths": "3.0", "type": "SingleFamily", "description": "Former ArrowCreek Desotoya model home. Beautiful and inviting kitchen with stainless appliances, granite counters, breakfast bar and separate eat-in area and great room that leads to the relaxing backyard patio.  Backyard is fully landscaped with auto sprinklers/drip and features a lovely courtyard with paver patio and wired for a spa.  Master suite features large walk in closet with California Closet built-ins, master bath with dual sinks and garden tub, and leads out to the balcony with stunning views of the valley and city.  Formal living and dining rooms, plus a large wonderful home office/den/workout room that can double as an additional bedroom or guest suite.  Downstairs and master is wired for surround sound.  Plantation shutters upstairs, and Hunter Douglas blinds downstairs accent the upgraded windows and doors. This wonderful home will make an ideal place to relax!"}
{"city": "Sunnyvale", "addr": "306 Windridge Dr", "zip": "75182", "price": "269000", "pid": "55832605", "homeSize": "3049", "seller": "Mathew Koshy", "beds": "3", "state": "TX", "yearBuilt": "2000", "lotSize": "6869", "baths": "2.5", "type": "SingleFamily"}
{"city": "Portland", "addr": "7802 SE Ramona St", "zip": "97206", "price": "239000", "pid": "58474984", "homeSize": "1380", "beds": "3", "state": "OR", "yearBuilt": "2002", "lotSize": "2500", "baths": "2.0", "type": "SingleFamily"}
{"city": "Stockton", "addr": "4041 Coastal Cove Ln", "zip": "95219", "price": "310000", "pid": "58724008", "homeSize": "1561", "seller": "Pat Holkesvig", "beds": "3", "state": "CA", "yearBuilt": "2003", "lotSize": "6000", "baths": "2.0", "type": "SingleFamily", "description": "Community water park and pool inside the gates.  3 bedrooms, 2 baths. 2 car garage. Open floorplan with lots of light.  Large kitchen with plenty of storage space. Oversized master bedroom with access to captivating backyard and patio. Spotless!  Lincoln schools. Easy freeway and shopping access.  Hurry, this one will not last!"}
{"city": "Scottsdale", "addr": "16231 N 99th Pl", "zip": "85260", "price": "475000", "pid": "59267470", "homeSize": "2129", "beds": "3", "state": "AZ", "yearBuilt": "2003", "lotSize": "6612", "baths": "2.0", "type": "SingleFamily", "description": "Stop the car honey, we found our house! Beautifully upgraded and looks like a model. All one level. Move in ready. Nothing else in the area compares to this beauty! Granite counters in kitchen and baths, stainless steel appliances, upgraded induction cooktop. Formal dining area in Living Room is being used as TV watching area but can be used either way. Fabulous lighting throughout home - most on dimmers. Exquisite faux paint touches throughout home. B/I speakers inside and out. Master bedroom has TWO huge master closets (custom built by the builder)and upgraded shower enclosure and mirrors. Resort-like backyard with Orange & Lemon trees, Gas Firepit, Outdoor Kitchen with BBQ, Cookstove and refrigerator. Pergola with 6 person hot tub too!"}
{"city": "San Antonio", "addr": "34 Sable Hts", "zip": "78258", "price": "405000", "pid": "60094812", "homeSize": "3281", "beds": "4", "state": "TX", "yearBuilt": "2001", "lotSize": "11761", "baths": "3.0", "type": "SingleFamily", "description": "Wonderful spacious home with open floor plan. Master with bath and huge walk-in closet. Two living and two dining areas. Kitchen with gas cooking opens up to breakfast area.  Big game/media room, study. Hardwood floor, tile and carpet (4 years). Beautiful chandeliers. Amazing pool, outdoor kitchen with granite and rock fireplace. "}
{"city": "Virginia Beach", "addr": "662 Waters Dr", "zip": "23462", "price": "77600", "pid": "60689127", "homeSize": "915", "seller": "Maria Woods", "beds": "2", "state": "VA", "yearBuilt": "1985", "baths": "2.0", "type": "Condominium", "description": "Approved short sale, ready to close.  Great location near Town Center, Interstate 264, movies, restaurants, bases and more. Nice view of stream from 2nd story deck, a great place for some quite relaxation.   Heating system and water heater replaced in 2011.  Two master suites, open kitchen with stainless steel appliances, under counter lighting and tile back splash.  Living room with beautiful stone fireplace, cathedral ceilings and skylights.  Condo fees include water, sewer, roof, outside maintenance, and trash removal. Assigned parking and plenty of visitor parking.  "}
{"city": "Virginia Beach", "addr": "1636 Chestwood Dr", "zip": "23453", "price": "375000", "pid": "60712219", "homeSize": "2744", "seller": "Military Relocation Team", "beds": "4", "state": "VA", "yearBuilt": "1996", "lotSize": "7843", "baths": "2.5", "type": "SingleFamily", "description": "Absolutely stunning, custom home with upgrades galore! Gourmet kitchen, inlaid tile, SS appliances, open floor plan, large bedrooms,hardwood floors in many rooms! A real beauty!"}
{"city": "Sacramento", "addr": "5381 Dasco Way", "zip": "95835", "price": "379900", "pid": "61242789", "homeSize": "2347", "beds": "4", "state": "CA", "yearBuilt": "2003", "lotSize": "5896", "baths": "3.0", "type": "SingleFamily"}
{"city": "Stockton", "addr": "10594 Dnieper Ln", "zip": "95219", "price": "305000", "pid": "61345644", "homeSize": "1966", "seller": "Serina Molina", "beds": "4", "state": "CA", "yearBuilt": "2004", "lotSize": "6238", "baths": "2.0", "type": "SingleFamily", "description": "Fabulous 4 bedroom -1 story plan in Spanos. Close to shopping, schools and freeway. Enjoy the clubhouse and pool in the area"}
{"city": "Washington", "addr": "2735 Olive St NW # 1", "zip": "20007", "price": "985000", "pid": "61618417", "homeSize": "765", "beds": "1", "state": "DC", "yearBuilt": "2002", "lotSize": "1316", "baths": "1.0", "type": "MultiFamily2To4", "description": "Stunning one of a kind renovation in the heart of Georgetown's East Village. Large private patio and off street parking. "}
{"city": "Seattle", "addr": "4544 41st Ave SW APT A", "zip": "98116", "price": "335000", "pid": "61765855", "homeSize": "1000", "beds": "2", "state": "WA", "yearBuilt": "2004", "lotSize": "982", "baths": "2.0", "type": "Townhouse", "description": "Available now is this conveniently located 3 story townhome next to the Alaska Junction business district of West Seattle! Cozy, bright and modern, this townhome features hardwood floors throughout the main level with gas fireplace and a accent wall with creative flare. The kitchen has stainless steel appliances, stone tile back splash, stone tile counters, gas stove and plenty of cabinet and counter space.A universal tv wall mount is provided above the gas fireplace. Upstairs features a full bath, office nook, and the larger bedroom. Cascade Mountains 'peek-a-boo' views from the upstairs bedroom on those clear days! Carpets throughout the 1st floor and 3rd floor. The entry features stone tile flooring, the 2nd bathroom (.75), Washer & Dryer, the 2nd bedroom with access to the stone garden. The stone garden is very easy to maintain and it's fully fenced. Grow your own fruits and vegetables in the side veggie garden! Ready for planting! Very efficient Radiant Heating is equipped with this townhome! Home is CAT-5 equipped and ready for High Speed Internet! 1 Reserved parking stall in front of townhome.Utilities are tenant's responsibility. See Video Tour under \"Video Tour\" tab orhttp://youtu.be/ZMvSNDhyHFQ 12 month leaseDeposit is equal to first months rent.$36 non refundable application fee per each tenant over the age of 18.$350 refundable pet deposit. Pets are subject to owners approval.$95 move-in fee. Renters Insurance Required.Utilities are tenant's responsibility.Non Smoking"}
{"city": "Portland", "addr": "10263 SW Daphne Pl", "zip": "97219", "price": "1675000", "pid": "61810597", "homeSize": "5278", "beds": "5", "state": "OR", "yearBuilt": "2004", "lotSize": "22651", "baths": "4.5", "type": "SingleFamily", "description": "Nestled away on a private deadend street in the picturesque Dunthorpe neighborhood is this treasure of a property. Lightly lived-in and meticulous condition, the lovely home features main level living and great room floor plan. Hardwood floors throughout nearly all of the home, gorgeous custom millwork, high ceilings, plantation shutters and gorgeous cabinetry are just a few of the special qualities. Peaceful half acre lot with water features and four car garage complete this unqiue package. Riverdale Schools."}
{"city": "San Diego", "addr": "17123 W Bernardo Dr APT 108", "zip": "92127", "price": "288800", "pid": "62773488", "homeSize": "955", "beds": "2", "state": "CA", "yearBuilt": "1994", "lotSize": "1", "baths": "2.0", "type": "Condominium", "description": "Brokered And Advertised By: Big Block Realty. Real Estate Listing Agent: Michael Mastro 619-917-9096.\nBest location in the Waterbridge community. No stairs. Beautiful pond views from kitchen, living room, dining room. Award winning Poway Unified School District. Close to shopping, dining, freeways. 2 bedrooms, 2 full bathrooms, 2 reserved, gated parking spots. Fantastic amenities including pool, spa, gym, clubhouse, playground. Low HOAs. No Mello-Roos."}
{"city": "San Jose", "addr": "786 Berryessa Rd", "zip": "95112", "price": "724888", "pid": "63065099", "homeSize": "1814", "beds": "3", "state": "CA", "yearBuilt": "2004", "lotSize": "3049", "baths": "3.0", "type": "SingleFamily", "description": "Great 3 bedroom/3 bathroom + loft! Centrally located with easy freeway access. More Photos and Info Coming Soon!!!"}
{"city": "San Diego", "addr": "10248 Maya Linda Rd APT 38", "zip": "92126", "price": "175000", "pid": "63895186", "homeSize": "610", "beds": "1", "state": "CA", "baths": "1.0", "type": "Condominium", "description": "Coming Soon "}
{"city": "Raleigh", "addr": "5305 Harrington Grove Dr", "zip": "27613", "price": "329900", "pid": "6536236", "homeSize": "2656", "beds": "4", "state": "NC", "yearBuilt": "1993", "lotSize": "8712", "baths": "2.5", "type": "SingleFamily"}
{"city": "San Diego", "addr": "1912 Diamond St UNIT 2", "zip": "92109", "price": "439000", "pid": "66666920", "homeSize": "1141", "beds": "2", "state": "CA", "baths": "2.5", "type": "Condominium", "description": "Variable list price $439,000-$489,000.  Each Bedroom has its own full bath. Solar!!  Looks like a designer lives here! Come see it Open House Saturday April 11,  1-4"}
{"city": "Washington", "addr": "4212 Benning Rd NE APT 6", "zip": "20019", "price": "94500", "pid": "68082007", "homeSize": "703", "seller": "Kathy Mason", "beds": "2", "state": "DC", "yearBuilt": "1939", "lotSize": "860", "baths": "1.0", "type": "Condominium", "description": "Will Not Last! Great Top Floor Condominium with 2 Bedrooms and 1 Bath Located Conveniently on Benning Road Less than .25 from the Metro. Great Unit with Stainless Steel Appliances, Granite Countertops, New Carpet, and Paint Throughout. Sentri lockbox will be on 4208 Railing.ELECTRICITY CURRENTLY NOT ON. No FHA financing. Cash or Conventional Only."}
{"city": "Tampa", "addr": "3828 W Platt St", "zip": "33609", "price": "675000", "pid": "68588721", "homeSize": "3666", "beds": "4", "state": "FL", "yearBuilt": "2007", "lotSize": "1742", "baths": "3.0", "type": "SingleFamily", "description": "NEW PHOTOS AND VIDEO TOUR POSTED SOON!!\n\nINQUIRE FOR MORE DETAILS!"}
{"city": "Stockton", "addr": "3125 Sonata Cir", "zip": "95212", "price": "274950", "pid": "69028453", "homeSize": "2219", "seller": "Pat Holkesvig", "beds": "4", "state": "CA", "yearBuilt": "2005", "lotSize": "5084", "baths": "2.5", "type": "SingleFamily", "description": "Luxurious Home in Northeast Stockton!  Newer home in impeccable condition.  Open floor plan with soaring ceilings. Spotless gourmet kitchen. Cozy family room. Dual stair cases to upstairs loft area.  Large master suite with dual walk-in closets. Vanity with built in dressing table.  Beautiful landscaped backyard.  Close to neighborhood schools, parks shopping & freeway.  \n"}
{"city": "Sunnyvale", "addr": "301 Stone Mountain Dr", "zip": "75182", "price": "350000", "pid": "69673685", "homeSize": "3406", "beds": "4", "state": "TX", "yearBuilt": "2005", "lotSize": "17424", "baths": "3.0", "type": "SingleFamily", "description": "Coming Soon! This fabulous 4 bedroom home is located in the coveted Homestead subdivision featuring private ponds, beautiful walking trails, and much sought after Sunnyvale ISD. Seller is in the process of completing updates and repairs throughout! The actual list price is subject to change depending on final seller evaluation and actual repairs/updates completed! Contact us in order to get on the private list and be the first in line to view this home!"}
{"city": "Portland", "addr": "5823 SW 53rd Ave", "zip": "97221", "price": "395000", "pid": "70513937", "homeSize": "1642", "beds": "3", "state": "OR", "yearBuilt": "1927", "lotSize": "5662", "baths": "1.0", "type": "SingleFamily"}
{"city": "Portland", "addr": "1221 SW 10th Ave UNIT 908", "zip": "97205", "price": "399999", "pid": "70515023", "homeSize": "868", "beds": "1", "state": "OR", "yearBuilt": "2006", "baths": "1.0", "type": "Condominium", "description": "Beautiful condo unit at The Eliot, with private bedroom, large open floorplan with lots of windows, great city views, full time Concierge, large laundry room and top of the line appliances, including a high efficiency washer and dryer. The Eliot Tower has a library with fireplace, large exercise room, private entertainment patio with full kitchen, and is across the street from the Portland Art Museum, shops and dining. It is within walking distance to PSU and the trolley to OHSU. It doesn't get better than this!Grocery shopping is right across the street at the fantastic Safeway store. You won't have to leave your covered reserved parking space in the garage to shop. "}
{"city": "Tucson", "addr": "147 E Castlefield Cir", "zip": "85704", "price": "280000", "pid": "71694150", "homeSize": "2205", "seller": "Michael Shiner, MBA", "beds": "3", "state": "AZ", "yearBuilt": "2006", "lotSize": "3484", "baths": "2.5", "type": "SingleFamily", "description": "Seller will accept or counter offers from $280,000-$295,000. UNOBSTRUCTED MOUNTAIN VIEWS to the North. One of the best homes in this popular subdivision on a CORNER lot w/Private Courtyard. 3BD/3BA, gorgeous slab GRANITE countertops and hickory cabinets in a gourmet kitchen with SS Appliances, deck off 3rd bedroom, vacuum system, surround sound prewire, Fireplace, EXPANSIVE rooms, LARGE walled YARD that wraps around the house, 2-Car Tandem Garage, HIGH Ceilings, cultured granite baths, custom flooring and window coverings. All of this located adjacent to the acclaimed Rillito River Walk and just down the street from tons of shopping amenities including the Tucson Mall. Come take a look at this well appointed home today!"}
{"city": "Reno", "addr": "1055 Keele Dr", "zip": "89509", "price": "324900", "pid": "7258859", "homeSize": "1764", "seller": "Joseph Wieczorek", "beds": "3", "state": "NV", "yearBuilt": "1975", "lotSize": "10018", "baths": "2.0", "type": "SingleFamily", "description": "Located off Mayberry Drive. Kitchen has hardwood floors with gas stove, dishwasher, refrigerator, microwave and granite counter tops. Remodeled master bath with heated tile flooring. Den/office could be used as fourth bedroom.  Laundry room with washer and dryer. Evaporative cooler and gas heating. Gas fireplace. Fenced landscaped backyard. RV parking space. Do not disturb tenants.  Call Joe (775) 335-5962 for more information"}
{"city": "Reno", "addr": "7620 Yorkshire Dr", "zip": "89506", "price": "165000", "pid": "7311884", "homeSize": "1020", "beds": "3", "state": "NV", "yearBuilt": "1965", "lotSize": "7405", "baths": "2.0", "type": "SingleFamily", "description": "Stunning remodel--From the charming curb appeal to the breathtaking kitchen, well done in every way. Upgraded carpet and laminate flooring, a heated/cooled sunroom not included in square footage, the owner removed the wall and opened up the kitchen to the family room with solid cherry cabinetry, corian counters and tons of storage and counter space for prep. The hall bath was updated with great cabinets and storage, abundant closet space, see additional. . . Brokered And Advertised By: Re/Max Realty Affiliates, Reno - Listing Agent: Diane Heaton, Heaton Home Team dheaton@remax.net"}
{"city": "Reno", "addr": "10180 Coyote Creek Ct", "zip": "89521", "price": "324500", "pid": "7331330", "homeSize": "2145", "seller": "Joseph Wieczorek", "beds": "4", "state": "NV", "yearBuilt": "1998", "lotSize": "5793", "baths": "3.0", "type": "SingleFamily", "description": "Freshly painted, new blinds, new carpet, and a completely remodeled master bathroom.  Showings to begin on 03/13/15  Call Joe at 775.335.5962 for more information"}
{"city": "Scottsdale", "addr": "8501 E Catalina Dr", "zip": "85251", "price": "285000", "pid": "7575600", "homeSize": "1460", "seller": "Shar Rundio", "beds": "3", "state": "AZ", "yearBuilt": "1961", "lotSize": "9435", "baths": "2.0", "type": "SingleFamily", "description": "Charming family home has open great room floor plan with light filled living area and spacious kitchen. Good sized bedrooms and large baths.  The backyard boasts lots of room for enjoyment.  The refreshing pool with shady patio off the kitchen is ready for your enjoyment. Excellent extra storage room and separate laundry. Storage space galore! Desert landscaping in front. Quiet neighborhood - walk to Pima park! Easy access to 101, close to shopping & near two public golf courses!"}
{"city": "Scottsdale", "addr": "8237 E Thomas Rd", "zip": "85251", "price": "158000", "pid": "7580595", "homeSize": "1328", "beds": "3", "state": "AZ", "yearBuilt": "1973", "lotSize": "1734", "baths": "2.75", "type": "Condominium"}
{"city": "Wichita", "addr": "8209 E Orme St", "zip": "67207", "price": "85000", "pid": "77317017", "homeSize": "1116", "beds": "3", "state": "KS", "yearBuilt": "1957", "lotSize": "8712", "baths": "2.0", "type": "SingleFamily"}
{"city": "Wichita", "addr": "934 S Broadmoor Ave", "zip": "67207", "price": "109900", "pid": "77320934", "homeSize": "1104", "beds": "3", "state": "KS", "yearBuilt": "1964", "lotSize": "10019", "baths": "1.5", "type": "SingleFamily"}
{"city": "Wichita", "addr": "2218 Elpyco St", "zip": "67218", "price": "75000", "pid": "77353749", "homeSize": "1025", "beds": "3", "state": "KS", "yearBuilt": "1952", "lotSize": "6534", "baths": "1.0", "type": "SingleFamily"}
{"city": "Wichita", "addr": "931 S Hiram St", "zip": "67213", "price": "79000", "pid": "77365650", "homeSize": "2338", "beds": "5", "state": "KS", "yearBuilt": "1950", "lotSize": "8712", "baths": "2.0", "type": "SingleFamily"}
{"city": "Wichita", "addr": "1300 N Saint Paul St", "zip": "67203", "price": "77500", "pid": "77384570", "homeSize": "972", "beds": "2", "state": "KS", "yearBuilt": "1951", "lotSize": "10019", "baths": "1.0", "type": "SingleFamily"}
{"city": "Scottsdale", "addr": "4800 N 68th St UNIT 151", "zip": "85251", "price": "260000", "pid": "7844656", "homeSize": "1628", "seller": "Matthew Long", "beds": "2", "state": "AZ", "yearBuilt": "1969", "lotSize": "1000", "baths": "2.0", "type": "Townhouse", "description": "Beautiful townhome located next-door to downtown fashion district of Scottsdale. This 2 bedroom, 2 bath townhome has been recently remodeled to feature new contemporary cabinetry, honed granite counters, Viking & Jenn-Air SS Appliances, tile/handicap retrofitted master bath, and modern plumbing/lighting fixtures. Scottsdale House private community is a 24/7 guard gated community offering a restaurant/bar, Barber/salon, Pool/Spa, exercise/weight room, massage therapy, and personal shuttle service. Walking distance to great restaurants & stores for fine dining, shopping, and entertainment found only in Old Town Scottsdale. "}
{"city": "Stockton", "addr": "4517 Woodbine Dr", "zip": "95210", "price": "224500", "pid": "79581884", "homeSize": "1717", "seller": "Michael Maio", "beds": "3", "state": "CA", "yearBuilt": "2007", "lotSize": "2445", "baths": "2.5", "type": "SingleFamily", "description": "Welcome to Charlotte oaks! This private community is a must see to appreciate! This beautiful low maintenance Stockton home features 1717 Square feet of living space and shows like a model home! Come and see for yourself, this home is priced to sell and will not last! Schedule a private showing today! Home may come fully furnished with suitable offer, solar panels owned outright. \n"}
{"city": "Scottsdale", "addr": "10950 E Hope Dr", "zip": "85259", "price": "264000", "pid": "8058340", "homeSize": "1008", "seller": "Rich Madden", "beds": "2", "state": "AZ", "yearBuilt": "1986", "lotSize": "3394", "baths": "1.5", "type": "Townhouse", "description": "Simply stunning remodeled single level patio home. Top quality & custom craftsmanship rarely found at this price point. Private spacious patio area with mature landscaping includes cactus garden, timed irrigation & low voltage exterior lighting - perfect for entertaining! Chef's kitchen to die for featuring Sub-Zero Refrigerator, Freezer with custom front panels. Custom book shelves & wine storage surrounding Sub-Zero's. Bosch ''Evolution'' Convection Range with Decor Warming Drawer. Kohler stainless sink w/new disposal. Custom Cabinets with 6 panel beveled glass uppers, all with pull out drawers. Vissani 50 bottle wine storage cabinet. Anderson solid wood bi-swing out dual pane windows. Recessed lighting. Living area features built-in entertainment center w/lighting, wood burning stacked\n\nstoned fireplace & custom wood mantle. Master showcases large walk-in \"California Closet\" white w/wood trim. Redesigned bathroom w/ custom tiled walk-in shower & 3/4\" glass enclosure. 2nd bedroom currently professional office w/ 3 area work space w/built in shelving & lots of storage. Newer roof w/transferrable warranty. Recent professional inspection provided to buyer at no cost. Seller offering $2,000 buyer incentive for closing costs. Home warranty in place & can be transferred for 1 yr. Popular community features pool & tennis. This is a traditional sale, not a bank owned foreclosure or short sale nightmare!"}
{"city": "Saint Paul", "addr": "406 Wacouta St UNIT 202", "zip": "55101", "price": "155000", "pid": "81750836", "homeSize": "648", "seller": "Michael Smith", "beds": "1", "state": "MN", "yearBuilt": "1905", "lotSize": "645", "baths": "1.0", "type": "Condominium", "description": "Historic brick/timber loft overlooking Mears Park in Lowertown! Just steps away from Stadium, Farmer's Market, light rail, connected to skyway. This stylish condo has stained concrete floors, 13 Ft ceilings, custom wall system, huge windows, great layout!"}
{"city": "San Diego", "addr": "15801 Concord Ridge Ter", "zip": "92127", "price": "888000", "pid": "81963015", "homeSize": "3005", "beds": "4", "state": "CA", "yearBuilt": "2007", "lotSize": "5773", "baths": "3.5", "type": "SingleFamily", "description": "Del Sur, San Diego's finest master planned community. Walk to Del Sur Elementary. Send your kids to the best Schools in the award winning Poway Unified School District."}
{"city": "Portland", "addr": "6025 SW Hood Ave", "zip": "97239", "price": "359900", "pid": "82334301", "homeSize": "1324", "beds": "3", "state": "OR", "yearBuilt": "2008", "lotSize": "2225", "baths": "2.5", "type": "SingleFamily"}
{"city": "San Francisco", "addr": "1160 Mission St UNIT 2302", "zip": "94103", "price": "925000", "pid": "83154174", "homeSize": "764", "beds": "1", "state": "CA", "yearBuilt": "2007", "baths": "1.0", "type": "Condominium", "description": "Coming Soon: Modern Luxury Penthouse with Panoramic City and Water Views This desirable 1 bedroom plus den penthouse floor plan features floor-to-ceiling glass windows, an east-facing balcony, and expanded 10-foot ceiling heights. The open concept living room/dining room/kitchen is ideal for entertaining, and the chefs kitchen offers Studio Becker cabinetry in a light espresso finish, under-cabinet and pendant designer lighting, Bosch stainless steel appliances, a vented gas range, and expansive Caesarstone countertops. The spa-like bathroom is elegantly appointed with limestone surrounds and counters, Maxstone Italian ceramic tile flooring, a rain-style shower with an upgraded glass enclosure, and Cifial fixtures. The den is perfect for an office area, recreation alcove, media room, or for a guest area. This residence has been extensively upgraded with wide-plank hardwood floors, an in-unit full capacity energy-efficient Bosch washer and dryer, Hunter Douglas window treatments, and fiber-optic wiring. SOMA Grands fifth-floor garden level features a full fitness center, hot tub, sun deck with cabanas, yoga studio, meditation garden, fire pit, barbecue area with picnic bench seating, and club room with a chefs kitchen and plasma TV. SOMA Grands luxury lifestyle services include bi-monthly housekeeping, concierge services, 24-hour security, a DVD library, Philz coffee and tea service, wireless internet in the lobby, and a wellness room for private instruction or massage. The building community also offers wine tastings, yoga and cooking classes, a book club, movie nights and special event gatherings. Residence #2302 Features:  1 bedroom plus den, 1 bathroom penthouse Large floor-to-ceiling windows Generous ceiling heights Chefs kitchen with Bosch stainless appliances, Caesarstone counters, Studio Becker German-engineered cabinetry Spa-like bathroom features limestone surrounds and counters, Maxstone ceramic tile flooring, rain-style shower with upgraded glass enclosure, Cifial fixtures Hardwood floors throughout living areas and bedrooms Fiber-optic wiring Washer and dryer in unit 1-car parking SOMA Grand Luxury Lifestyle Services The SOMA Grand staff is expertly trained in a service culture that elevates homeowners to the level of pampered hotel guests. SOMA Grand, a San Francisco luxury condo residence, is a full-service high-rise community with concierge service. The staff is hotel-trained and ready to take care of every business or personal request on demand. From dinner reservations to car service, from dog-walkers to personal shoppers, from a masseuse to a caterer, this San Francisco luxury condo property gives you access to only the best.  Twice-a-month housekeeping Concierge 24-hour security Philz coffee and tea available in lobby DVD lending library Monthly wine tastings Wireless internet in lobby and park level along with a community extranet Concierge-assisted reservations A la carte services offered at an additional charge include: SOMA Dog Certified dog trainer, spa facility, yoga and Pilates, laundry services, interior design, cooking classes, technology services, fresh flower and plant care services, child care, personal trainer/nutritionist, UPS and FedEx, doctors-on-call SOMA Grand Building Amenities Define Affordable Luxury Living beautifully no longer requires living beyond your means. Whether you are making your first real estate purchase, moving to the San Francisco Bay Area, or simply investing wisely in property for the future, SOMA Grand has been designed to allow you to live, work and play in grand style. A luxury condominium in San Francisco, the 22-story glass tower offers visual excitement, rich textures, and a polished sense of design. An eclectic mix of people combined with inspirational common areas are the bedrock for a thriving community in San Francisco. "}
{"city": "Tucson", "addr": "1308 W Kleindale Rd", "zip": "85705", "price": "124900", "pid": "8436923", "homeSize": "912", "beds": "3", "state": "AZ", "yearBuilt": "1958", "lotSize": "6969", "baths": "1.75", "type": "SingleFamily"}
{"city": "Tucson", "addr": "1619 N Treat Ave", "zip": "85716", "price": "157000", "pid": "8498243", "homeSize": "1048", "seller": "Michael Shiner, MBA", "beds": "2", "state": "AZ", "yearBuilt": "1947", "lotSize": "8875", "baths": "1.0", "type": "SingleFamily", "description": " Charming Wire-Cut Red brick BLENMAN Bungalow in a fantastic location with so much upside! This 2BD/1BA home, on a GIGANTIC 8,712sqft lot, has a TREMENDOUS backyard that is full of potential. The kitchen has all NEW stainless steel appliances, beautiful tile accents, porcelain counter tops and tons of room to work your culinary magic. The home has ceramic tile throughout for easy living and is right down the street from The Arizona Inn, U of A Campus, the Medical Center, many transportation and shopping options and so much more!"}
{"city": "Tucson", "addr": "5209 E Andrew St", "zip": "85711", "price": "99900", "pid": "8518855", "homeSize": "943", "beds": "3", "state": "AZ", "yearBuilt": "1959", "lotSize": "7840", "baths": "2.0", "type": "SingleFamily", "description": "Seller will accept or counter offers between $99,900 and $109,900.  Three bedroom two bath home with large yard. Storage shed in back as well as laundry/utility room. Newer windows. Contact listing agent Kat Tyree to arrange an appointment! TucsonKat@gmail.com, 520-730-5540"}
{"city": "Tucson", "addr": "1018 N Camino Las Solanas", "zip": "85710", "price": "109500", "pid": "8534310", "homeSize": "1033", "beds": "2", "state": "AZ", "yearBuilt": "1973", "baths": "2.0", "type": "Condominium", "description": "Wonderful east side end unit 2BR/2BA townhome with great open floor plan awaits you! This is truly Move-in condition. Ceramic tile floors throughout, updated kitchen with ceramic tile countertops, updated baths, good size bedrooms, private back patio, and nice community pool. So what are you waiting for, this is a must see. "}
{"city": "Tucson", "addr": "8317 E Pena Blanca Dr", "zip": "85730", "price": "175000", "pid": "8550400", "homeSize": "962", "beds": "3", "state": "AZ", "yearBuilt": "1963", "lotSize": "7405", "baths": "1.0", "type": "SingleFamily"}
{"city": "Tucson", "addr": "227 E 20th St", "zip": "85701", "price": "190000", "pid": "87927996", "homeSize": "1072", "state": "AZ", "yearBuilt": "2007", "lotSize": "5000", "type": "SingleFamily", "description": "Call for details."}
{"city": "Washington", "addr": "52 Quincy Pl NW APT 104", "zip": "20001", "price": "380500", "pid": "88799659", "homeSize": "752", "beds": "2", "state": "DC", "yearBuilt": "1912", "lotSize": "280", "baths": "1.5", "type": "Condominium"}
{"city": "San Diego", "addr": "3650 5th Ave UNIT 313", "zip": "92103", "price": "389900", "pid": "89229457", "homeSize": "864", "beds": "1", "state": "CA", "yearBuilt": "2009", "baths": "1.0", "type": "Condominium", "description": "This home blends one of the most desired locations in Hillcrest with the best 1 bedroom floorplan in Atlas. The huge balcony makes the home feel even more spacious and is something not normally found in a condo. What a great place to relax or entertain! Tastefully upgraded cabinets, granite counters & shower surround, hip kitchen backsplash, and beautiful hardwood floors make this a place you will love calling home. Atlas offers terrific amenities including pool/spa, fitness center, & social lounge. Call Chris Hein at 858-775-4346 for more information or to view this property."}
{"city": "Sunnyvale", "addr": "284 Talbot Ln", "zip": "75182", "price": "400000", "pid": "89399895", "homeSize": "3355", "beds": "4", "state": "TX", "yearBuilt": "2008", "lotSize": "18238", "baths": "3.5", "type": "SingleFamily"}
{"city": "RIVERSIDE", "addr": "3683 Everest Ave", "zip": "92503", "price": "375000", "pid": "95866199", "homeSize": "1554", "beds": "4", "state": "CA", "yearBuilt": "2015", "lotSize": "8712", "baths": "2.0", "type": "SingleFamily", "description": "Brand new construction built in 2015. Granite counter, tile floors, new carpeting. Everything is brand new. Don't miss out! Call Adrian & Diane @ 909-994-8567.  "}
{"city": "RIVERSIDE", "addr": "3687 Everest Ave", "zip": "92503", "price": "390000", "pid": "95943147", "homeSize": "1763", "beds": "4", "state": "CA", "yearBuilt": "2015", "lotSize": "14810", "baths": "2.0", "type": "SingleFamily"}
{"city": "Sunnyvale", "addr": "289 Brookwood Forest Dr", "zip": "75182", "price": "431499", "pid": "96533851", "homeSize": "4300", "beds": "4", "state": "TX", "yearBuilt": "2014", "lotSize": "20908", "baths": "5.0", "type": "SingleFamily", "description": "Corner lot  this is beautiful custom homes. Minutes to dining, entertainment and easy access to nearby 80 and 635 freeways. SELLER IS MOTIVATED! BRING US AN OFFER!"}
{"city": "Reno", "addr": "1699 Crescent Pointe Ct", "zip": "89523", "price": "587595", "pid": "97505021", "homeSize": "3304", "seller": "Joseph Wieczorek", "beds": "5", "state": "NV", "yearBuilt": "2013", "lotSize": "10156", "baths": "3.5", "type": "SingleFamily", "description": "Private cul-de-sac location in Somersett!  The Wellington model offers 5 bedrooms, 3.5 baths, 3 car garage, over 3300 sqft, and a bonus game room!  Upgrades and features include, main level master bedroom, hardwood floors, alder cabinets, and amazing landscaping."}
{"city": "Saint Louis", "addr": "3815 Linden Tree Ln", "zip": "63109", "price": "255000", "pid": "98971596", "homeSize": "1854", "beds": "3", "state": "MO", "yearBuilt": "2014", "lotSize": "4356", "baths": "2.0", "type": "Townhouse", "description": "COMING SOON! This 3 bedroom 2 bath townhouse is currently under construction and will be complete before the end of the year. BUY NOW and choose your finishes.  Surrounded by newer homes, this town home offers CITY LIVING at its finest. Enjoy all  South St. Louis has to offer -- Mom's Deli, Ted Drewes, Lindenwood Park,  and so much more, all just steps away. This is a great opportunity to live the CITY LIFE without the hassle of an old city home.  Enjoy the MODERN layout that is wonderful for entertaining. Finish the lower level for an added recreation room and bathroom.  And did you notice the two car ATTACHED garage? This home offers low-maintenance living with lawn care included in the HOA.  So many reasons to get more information on this gorgeous new town home built to cohesively fit in to the surrounding neighborhood.  "}
